{
  "abstract": {
    "abstract_text": "<?abstract ?><p num=\"0000\">Holder for the releasable fastening of a flat approximately rectangular device such as a tablet - computer or a smartphone on a component, in particular on a component of a motor vehicle, with a retaining element for receiving of the device, with a fastening element for fastening of the holder on the component and with a between the fastening element and the holding element provided on the carrier element, wherein the support element a coupling element for the detachable arrangement of an additional element which, in particular a power bank, a pocket or a bag, has on the coupling element. </p><p>\n  <img file=\"DE102016114803A1_0001.tif\" he=\"116\" img-content=\"drawing\" img-format=\"tif\" inline=\"no\" orientation=\"portrait\" wi=\"75\"/>\n</p>"
  },
  "claims": [
    {
      "claim_num": "1",
      "claim_text": "<claim-text>Holder (<figref>2</figref>) for the releasable fastening of a flat approximately rectangular device such as a tablet - computer or a smartphone on a component, in particular on a component of a motor vehicle, with a mounting element. (<figref>4</figref>) for receiving of the device, with a fastening element (<figref>16</figref>) to attach the retainer (<figref>2</figref>) at the component and with a between the fastening element (<figref>16</figref>) and the holding element (<figref>4</figref>) support element provided (<figref>8</figref>), <b>characterized by the,</b> that the support element (<figref>8</figref>) a coupling element (<figref>24</figref>) for the detachable arrangement of an additional element (<figref>32</figref>, <figref>62</figref>, <figref>68</figref>), in particular a power bank, a pocket or a bag, on the coupling element (<figref>24</figref>) having. </claim-text>",
      "depends_on": null,
      "word_count": 112
    },
    {
      "claim_num": "2",
      "claim_text": "<claim-text>Holder (<figref>2</figref>) according to claim 1, <b>characterized by the,</b> that the coupling element (<figref>24</figref>) an attachment section. (<figref>28</figref>) for the arrangement of the additional element thereon. </claim-text>",
      "depends_on": null,
      "word_count": 26
    },
    {
      "claim_num": "3",
      "claim_text": "<claim-text>Holder (<figref>2</figref>) according to claim 2, <b>characterized by the,</b> that the fastening portion (<figref>28</figref>) at least one recess, in particular a key hole, for the detachable arrangement of the additional element (<figref>32</figref>, <figref>62</figref>, <figref>68</figref>) at the coupling element (<figref>24</figref>) having.</claim-text>",
      "depends_on": null,
      "word_count": 40
    },
    {
      "claim_num": "4",
      "claim_text": "<claim-text>Holder (<figref>2</figref>) according to any one of claims 2 or 3, <b>characterized by the,</b> that the support element (<figref>8</figref>) a first side (<figref>9</figref>) and one of the first side (<figref>9</figref>) second side facing away from (<figref>14</figref>) , wherein the first side (<figref>9</figref>) a receiving device (<figref>12</figref>) for the detachable arrangement of the holding element (<figref>4</figref>) on the carrier element (<figref>8</figref>) , and wherein the coupling element (<figref>24</figref>) at least in sections to the second side (<figref>14</figref>) is arranged and on this side of the fastening section (<figref>28</figref>) having.</claim-text>",
      "depends_on": null,
      "word_count": 88
    },
    {
      "claim_num": "5",
      "claim_text": "<claim-text>Holder (<figref>2</figref>) according to any one of the preceding claims, <b>characterized by the,</b> that the coupling element (<figref>24</figref>) on the carrier element (<figref>8</figref>) is slipped on.</claim-text>",
      "depends_on": null,
      "word_count": 26
    },
    {
      "claim_num": "6",
      "claim_text": "<claim-text>Holder (<figref>2</figref>) according to claims 4 and 5, <b>characterized by the,</b> that the take-up device (<figref>12</figref>) as a recess is formed, and that the coupling element (<figref>24</figref>) a recess opening (<figref>26</figref>) so that the receiving means. (<figref>12</figref>) is exposed.</claim-text>",
      "depends_on": null,
      "word_count": 39
    },
    {
      "claim_num": "7",
      "claim_text": "<claim-text>Holder (<figref>2</figref>) according to claim 6, <b>characterized by the,</b> in that the holding element (<figref>4</figref>) an insertion section (<figref>10</figref>) for insertion into the receiving means. (<figref>12</figref>) , wherein the insertion section (<figref>10</figref>) is designed in such a way that this also the coupling element (<figref>24</figref>) in captive manner on the carrier element (<figref>8</figref>) holds.</claim-text>",
      "depends_on": null,
      "word_count": 54
    },
    {
      "claim_num": "8",
      "claim_text": "<claim-text>Holder (<figref>2</figref>) according to any one of the preceding claims, <b>characterized by the,</b> that the coupling element (<figref>24</figref>) a protruding projection (<figref>30</figref>) for lose - and / or secure the position of an additional element arranged thereon (<figref>32</figref>, <figref>62</figref>, <figref>68</figref>) and / or of an additional part is arranged in or on the additional element (<figref>48</figref>), in particular a power bank.</claim-text>",
      "depends_on": null,
      "word_count": 61
    },
    {
      "claim_num": "9",
      "claim_text": "<claim-text>Holder (<figref>2</figref>) according to any one of the preceding claims, <b>characterized by the,</b> that on the coupling element (<figref>24</figref>) as an additional element (<figref>32</figref>) a receiving surface is arranged, wherein the receiving surface can be bent in such a way that an additional part (<figref>48</figref>), in particular a power bank, lose - and / or is held securely in the can be arranged therein.</claim-text>",
      "depends_on": null,
      "word_count": 64
    },
    {
      "claim_num": "10",
      "claim_text": "<claim-text>Holder (<figref>2</figref>) according to claim 9, <b>characterized by the,</b> that the receiving surface (<figref>32</figref>) two bending portions (<figref>34</figref>, <figref>36</figref>) in each case with at least one film hinge. (<figref>40</figref>, <figref>42</figref>, <figref>44</figref>, <figref>46</figref>) having.</claim-text>",
      "depends_on": null,
      "word_count": 33
    },
    {
      "claim_num": "11",
      "claim_text": "<claim-text>Holder (<figref>2</figref>) according to claim 10, <b>characterized by the,</b> that the bending portions (<figref>34</figref>, <figref>36</figref>) by means of a securing means (<figref>56</figref>, <figref>60</figref>) for loss-proof holding an additional part (<figref>48</figref>), in particular a power bank, in the curved receiving surface (<figref>32</figref>) , can be tensioned against one another are. </claim-text>",
      "depends_on": null,
      "word_count": 49
    },
    {
      "claim_num": "12",
      "claim_text": "<claim-text>Holder (<figref>2</figref>) according to claims 8 and 11, <b>characterized by the,</b> that the unbent receiving surface (<figref>32</figref>) substantially perpendicularly to the projection (<figref>30</figref>) and that the securing means (<figref>56</figref>) the the projection (<figref>30</figref>) opposite side covers at least in sections, if the receiving surface (<figref>32</figref>) is bent, so that the additional part (<figref>48</figref>) in the receiving surface (<figref>32</figref>) arranged in a captive manner can be arranged or.</claim-text>",
      "depends_on": null,
      "word_count": 67
    },
    {
      "claim_num": "13",
      "claim_text": "<claim-text>Holder (<figref>2</figref>) according to any one of the preceding claims, <b>characterized by the,</b> that the additional element than at the coupling element (<figref>24</figref>) pocket positioned (<figref>62</figref>) or bag (<figref>68</figref>) is formed, whereby an additional part (<figref>48</figref>), in particular a power bank, in the pocket (<figref>62</figref>) or the bag (<figref>68</figref>) arranged in a form-locking manner can be arranged or.</claim-text>",
      "depends_on": null,
      "word_count": 58
    },
    {
      "claim_num": "14",
      "claim_text": "<claim-text>Holder (<figref>2</figref>) according to claim 13, <b>characterized by the,</b> that the pocket (<figref>62</figref>) or the bag (<figref>68</figref>) at least in sections, is elastic and / or that an elastically flexible holding part in the pocket (<figref>62</figref>) or the bag (<figref>68</figref>) for fixing the position of the additional part (<figref>48</figref>) is provided.</claim-text>",
      "depends_on": null,
      "word_count": 51
    },
    {
      "claim_num": "15",
      "claim_text": "<claim-text>Coupling element (<figref>24</figref>) and / or additional element (<figref>32</figref>, <figref>62</figref>, <figref>68</figref>) for a holder (<figref>2</figref>) according to any one of the preceding claims. </claim-text>",
      "depends_on": null,
      "word_count": 23
    }
  ],
  "country": "DE",
  "description": {
    "description_text": "<description mxw-id=\"PDES128025547\" lang=\"EN\" load-source=\"mxw-smt\">\n  <p num=\"0001\">The present invention relates to a holder for the releasable fastening of a flat approximately rectangular device such as a tablet - computer or a smartphone on a component, in particular on a component of a motor vehicle. In this case, the holder has a holding element for receiving of the device, a fastening element for fastening of the holder on the component as well as to a between the fastening element and the holding element is provided a support element. The present invention also relates to a coupling element and / or an additional element for a holder according to the invention. Such a holder is, for example, from the <patcit ucid=\"DE-102010006261-A1\"><text>DE 10 2010 006 261 A1</text></patcit> german patent no. Such holders are in particular on the backrest, headrest attached or head support mount of a vehicle seat. On the other hand, such holders, for example, also on the windshield or other windows of the vehicle are fastened. </p>\n  <p num=\"0002\">In this case, it has been found that there is a need in a simple manner and to attach additional parts to the holder. In the case of the additional parts can be, in particular be so-called power banks. A power bank is a portable energy storage device, in order to terminals, such as, for example, smart phones, and tablets to charge on the road. In simplified terms, a power bank that is to say a more or less large accumulator, the charges on the socket, in order to a later point in time when no socket in the range is no longer, other devices with the power bank charge. </p>\n  <p num=\"0003\">Among other things, consequently, the invention is the object of providing a fastening possibility for additional parts to the invention to provide a holder.</p>\n  <p num=\"0004\">In particular, the object of the invention is in the simplest manner possible for a charging mode and manner on the holder devices which are arranged to provide. </p>\n  <p num=\"0005\">This object is achieved by a holder with the features of claim 1, dissolved. It is, however, provided that the support element a coupling element for the detachable arrangement of an additional element which, in particular a power bank, a pocket or a bag, has on the coupling element. </p>\n  <p num=\"0006\">The coupling element can be permanently or, in particular, also be fastened releasably on the carrier element. Furthermore, the coupling element, with tin, with fastening means or securing means arranged at the coupling element and be freely. Thus, the coupling element on the carrier element be welded, with this caulked, glued, riveted or also be screwed. </p>\n  <p num=\"0007\">It is conceivable that an additional part, in particular a power bank in this case is arranged directly on the coupling element. On the other hand, it is also conceivable for a pocket or a bag is fastened at the coupling element and that the power bank as an additional part within the pocket or the bag is arranged. </p>\n  <p num=\"0008\">Thus, the invention, among other things, a particularly simple possibility is created, which is arranged on the holder device electrically charged. Nevertheless, the high safety - and licensing requirements for a component arranged in the motor vehicle interior be maintained, since, for example, a power bank for charging of the device can be fastened securely on the holder.</p>\n  <p num=\"0009\">Advantageously, the coupling element a fastening section for arranging the additional element on this. In this connection, it is conceivable that the fastening section and is designed as a velcro section, so that an additional element with a complementary as a velcro section can be fastened thereto, in order to form a result, a velcro fastener. </p>\n  <p num=\"0010\">On the other hand, it is also conceivable for the fastening section, at least one recess, in particular a key hole, for the detachable arrangement of the additional element which has at the coupling element. In particular, a plurality of be provided with recesses. The additional element can then for fastening to the recess complementary pins or studs in order to have the additional element lose - and positionally secure, but releasable manner on the coupling element to secure. </p>\n  <p num=\"0011\">It is also advantageous if the support element a first side and a second side facing away from the first side, wherein the first side a receiving device for the detachable arrangement of the holding element on the carrier element, and wherein the coupling element, at least in sections, on the second side is arranged and on this side has the fastening section. Thus, a simple and space-saving embodiment of the mounting of the additional element which is provided on the support.</p>\n  <p num=\"0012\">It is particularly preferred if that the coupling element is placed on the carrier element. In this way, a particularly simple possibility of fastening of the coupling element on the carrier element is created. The coupling element is consequently freely on the fastening means the support element. In particular, the coupling element in this case be designed to be elastically compliant and under a certain tension against the support element to provide a lose - and secure the position even in case of an accident, of the motor vehicle to guarantee. </p>\n  <p num=\"0013\"><?page 3?>In this connection, it is conceivable that the take-up device is designed as a recess, and in that the coupling element comprises a recess opening so that the recess is exposed when the coupling element is slipped on the carrier element. </p>\n  <p num=\"0014\">In this case, it is preferred if the holding element an insertion section for insertion into the recess, wherein the insertion section is designed in such a way that this also holds the coupling element in captive manner on the carrier element. Thus, first of all the coupling element to the carrier element be slipped on, wherein the holding element is removed from the carrier element. Then, the holding element can be fastened on the support element and secures the same time, then the coupling element lose - and securely to the carrier element. In this case, the insertion section of the holding element, in particular, be conical in construction. As a result, a particularly advantageous possibility is to be created. </p>\n  <p num=\"0015\">Advantageously, the coupling element, in addition, a projecting projection for lose - and secure the position of an additional element arranged thereon and / or of an additional part is arranged in or on the additional element, in particular a power bank, on. In this connection, it is conceivable that a power bank directly by means of a, in particular, silicone-like strip is fastened to the coupling element is tensioned. In addition or as an alternative, a fixing can be carried out by means of a velcro band. </p>\n  <p num=\"0016\">Preferably, at the coupling element comprises a receiving surface, which is designed as the additional element is arranged, wherein the receiving surface can be bent in such a way that an additional part, in particular a power bank, in a captive manner can be arranged therein. The receiving surface can in particular be bendable in such a way that the bent receiving surface forms a receiving box. In particular, when the coupling element comprises a projection, the projection together with the curved receiving surface form a receiving box. It is conceivable, in particular, that additional parts, such as, for example, power banks, different extent within the curved receiving surface can be absorbed. </p>\n  <p num=\"0017\">In this context it is conceivable, in particular, that the receiving surface in each case having at least two bending portions has a film hinge. In particular, when two film hinges are present, a kind of rectangular box can be provided if the receiving surface is bent around the film hinges. The bending of the two bending sections, by in each case two film hinges can be provided is a total of four side faces. A further side surface, especially by means of the projection of the coupling portion are made available. Thus, an additional part, by the introduction of the sixth, open area in the box-like be introduced into the mount. </p>\n  <p num=\"0018\">A particularly preferred further development of the invention provides that the bending portions by means of a securing means for lose - and secure mounting of an additional part, in particular a power bank, in the curved receptacle, can be tensioned against one another are. Thus, in particular additional parts, such as power banks, different size within the bent lose - and is held securely in the receiving surface are received. In particular can also be provided in the event of a crash, to provide for a secure positioning. In this case, in particular, the securing means may be resiliently flexible. It would be conceivable that the securing means as a cord or are designed as a velcro fastener tape. </p>\n  <p num=\"0019\">Particularly it is preferred, furthermore, when the unbent receiving surface extends substantially perpendicularly to the projection and the securing means the projection on the opposite side covers at least in sections, if the receiving surface is bent, so that the additional part in the receiving surface lose - and is held securely in the can be arranged or arranged. Thus, a box-like receptacle is to be provided, wherein an additional part located therein is secured by six sides, whereby the sixth side, through which the additional part is inserted into the receptacle, is secured by the securing means. The securing means may in this case, in particular be designed as an elastic lacing.</p>\n  <p num=\"0020\">On the other hand, it is also conceivable that the additional element as a pocket positioned at the coupling element or bag is formed, whereby an additional part, in particular a power bank, in the pocket or the bag or arranged in a form-locking manner can be arranged. Preferably, the pocket or of the bags at least in part elastic. Thus, in a particularly simple manner, additional parts, of different extent and are taken up against slippage.</p>\n  <p num=\"0021\">As an alternative or in addition, an elastically flexible holding part in the pocket or the bag be provided to fix the position of the additional part. The holding part can be, in particular, be designed as a spring element, or a resilient element. In particular as a result, an additional part in the pocket or the bag be fixed against slippage. Thus, in particular, a disadvantageous noise generated by rattling of the additional part in the operation of the motor vehicle, may be prevented. </p>\n  <p num=\"0022\"><?page 4?>The pocket or the bag can have a closure cap, which is adjustable in length and / or elastically can be formed, in order to be able to absorb additional parts of different length. </p>\n  <p num=\"0023\">The initially stated object is achieved also by achieved by a coupling element for a holder according to the invention. The coupling element is, consequently, for the arrangement on the carrier element in the form of a holder according to the invention. Furthermore, it is for the detachable arrangement of an additional element which, in particular a power bank, a pocket or a bag formed on the coupling element. </p>\n  <p num=\"0024\">Finally, the object set at the beginning is also achieved by an additional element for a holder according to the invention. The additional element can be, for example, a power bank, a pocket or a bag, the or of the for the arrangement on the coupling element of the holder are designed. The pocket or the bag in this case, in particular, for receiving a power bank be designed. </p>\n  <p num=\"0025\">Further details and advantageous embodiments of the invention can be seen in the following description, on the basis of which the embodiment shown in the drawings of the invention is described and explained in more detail. Fig:</p>\n  <p num=\"0026\"><figref>1 (a)</figref> Perspective representation of a holder with the coupling element on the carrier element with a holding element; (b) representation according to (a) from the carrier element with the holding element; (c) perspective rear view of the holder according to (a) without the holding element and from the carrier element with the coupling element; (d) perspective representation in accordance with (a) without holding element; (e) partially sectioned side view of the representation according to (a);</p>\n  <p num=\"0027\"><figref>2 (a)</figref> Perspective representation of a holder with attached additional element in the unfolded state; and (b) in the folded state is arranged in the additional element additional part; (c) representation according to (b) on the carrier element with a holding element; (d) representation according to (c) with the securing means;</p>\n  <p num=\"0028\"><figref>3</figref> Perspective representation of the holder according to <figref>2</figref> with additional element is arranged at the coupling element according to a first embodiment;</p>\n  <p num=\"0029\"><figref>4</figref> Perspective representation of the holder according to <figref>2</figref> with the coupling element arranged on the additional element according to a second embodiment, and</p>\n  <p num=\"0030\"><figref>5</figref> Perspective representation of the holder according to <figref>2</figref> with additional element is arranged at the coupling element according to a third embodiment.</p>\n  <p num=\"0031\"><figref>1</figref> as a whole with the reference number shows a <figref>2</figref> holder designated. This has a holding element <figref>4</figref> for receiving a device, such as, for example, of a tablet - computer or a smartphone on. For this purpose, the holding element <figref>4</figref> two connecting elements arranged at opposite sides clamp-type <figref>6a</figref>, <figref>6b</figref>, their distance from the receiving devices of different sizes can be adjusted, wherein at least one connecting element <figref>6a</figref>, <figref>6b</figref> along the holding element <figref>4</figref> in a guide is displaceable. </p>\n  <p num=\"0032\">The holding element <figref>4</figref> on a carrier element is pleuelf&#xF6;rmigen <figref>8</figref> so as to be rotatable about an axis of rotation x of a first rotary joint <figref>5</figref> mounted. For this purpose, the retaining element <figref>4</figref> on the rear side <figref>7</figref> a conical, projecting insertion section <figref>10</figref> in an, in <figref>1c</figref> to be recognized, for this purpose, provided as a recess complementary, and <figref>12</figref> on the carrier element <figref>8</figref> and is rotatably mounted therein. The receiving means. <figref>12</figref> on the front side (first side) <figref>9</figref> of the carrier element. <figref>8</figref> provided. The first swivel joint. <figref>5</figref> as a friction hinge is formed, so that the respective position of the holding element <figref>4</figref> to the carrier element <figref>8</figref> is reliably retained. </p>\n  <p num=\"0033\">On the rear side (second side) <figref>14</figref> of the carrier element. <figref>8</figref> a fastening element is <figref>16</figref> rotatably arranged. The fastening element <figref>16</figref> in this case is by way of a double joint with the support element <figref>8</figref> connected. Thus the fixing element is <figref>16</figref> about the axis of rotation x by a second rotary joint <figref>18</figref> relative to the carrier element <figref>8</figref> rotatably. Furthermore, the fastening element <figref>16</figref> about the axis of rotation extending perpendicular to the axis of rotation x y about a third rotary joint <figref>20</figref> rotatably. </p>\n  <p num=\"0034\">The fastening element <figref>16</figref> also has a fitment part <figref>20</figref> on. This comprises a detachable locking device <figref>23</figref> with a lateral key <figref>22</figref>, so that the holder <figref>2</figref> in a receiving bushing (not shown) a on a component in particular of a motor vehicle can be locked detachably receiving element is arranged. Thus, for example, between the headrest support rods of a headrest of a vehicle seat, a clamping element, which has the receiving bushing be arranged. </p>\n  <p num=\"0035\">On the carrier element <figref>8</figref> a coupling element is <figref>24</figref> its. In this case, the coupling element <figref>24</figref> elastically resilient and is in the slipped-on state under pretension at least essentially in a positively locking manner on the carrier element <figref>8</figref> on. In this case, the coupling element <figref>24</figref> on the free, the recess <figref>12</figref> the invention, in which the end region of the <?page 5?>Carrier element. <figref>8</figref> plugged. In order to provide an accessibility of the recess <figref>12</figref> to ensure has, as shown in <figref>1c</figref> it can be seen, the coupling element <figref>24</figref> an opening <figref>26</figref> on. Thus, at first for the arrangement of the coupling element <figref>24</figref> this over the carrier element <figref>8</figref> inverted. Then, the holding element <figref>4</figref> by means of the insertion section. <figref>10</figref> in the recess <figref>12</figref> of the carrier element. <figref>8</figref> fastened. In this case, the opening <figref>26</figref> formed in such a way that, in particular on account of the conical design of the insertion section. <figref>10</figref> the coupling element <figref>24</figref> lose - and securely to the carrier element <figref>8</figref> by the insertion section <figref>10</figref> contact the edge of the opening <figref>26</figref> is. </p>\n  <p num=\"0036\">On the of the first side <figref>9</figref> second side facing away from <figref>14</figref> the coupling element has <figref>24</figref> a total of three key perforations <figref>28</figref> , which are arranged with respect to one another in a triangle. The key perforations <figref>28</figref> form of an attachment section. </p>\n  <p num=\"0037\">At the inverted free end of the coupling element <figref>24</figref> is a of the main extent of the coupling element <figref>24</figref> projecting projection <figref>30</figref> provided. This projects at right angles to the main extent of the carrier element. <figref>8</figref> as well as of the coupling element <figref>24</figref> from the coupling element <figref>24</figref> starting from. </p>\n  <p num=\"0038\">As shown in <figref>2</figref> is shown, on the coupling element is <figref>24</figref> additional element, which is designed as a receiving surface <figref>32</figref> arranged. For this purpose, the additional element <figref>32</figref> to the key perforations <figref>28</figref> of the coupling element <figref>24</figref> complementary pins, so that the additional element <figref>32</figref> in a detachable manner on the coupling element <figref>24</figref> is arranged. The additional element <figref>32</figref> comprises two bending portions <figref>34</figref>, <figref>36</figref>, each of which the width of the coupling element <figref>24</figref> as well as of the carrier element. <figref>8</figref> project beyond. The bending portions <figref>34</figref>, <figref>36</figref> in each case comprise two film hinges <figref>40</figref>, <figref>42</figref>, <figref>44</figref>, <figref>46</figref>. </p>\n  <p num=\"0039\">If the additional element <figref>32</figref> in order to the film hinges <figref>40</figref>, <figref>42</figref>, <figref>44</figref>, <figref>46</figref> is curved so, together with the coupling element side projection <figref>30</figref> a box-like receiving <figref>41</figref> is created. In this is, as shown in figs. <figref>2b</figref> to <figref>2d</figref> it can be seen, an additional part <figref>48</figref> can be introduced. The additional part <figref>48</figref> may in this case, in particular be designed as a so-called power bank, so that a on the retaining element <figref>4</figref> an electronic device is arranged wirelessly or can be charged. The double bent free end regions <figref>50</figref>, <figref>52</figref> of the additional element <figref>32</figref> form in this case an the carrier element <figref>8</figref> opposite side of the receiving area <figref>41</figref> from. </p>\n  <p num=\"0040\">In this case, these sections have <figref>50</figref>, <figref>52</figref> in each case three, arranged one above the other in a row of eyelets <figref>54</figref> on. By these eyes <figref>54</figref> if, as in the <figref>2b</figref> to <figref>2d</figref> , similar to of the lacing of a shoelace a securing element designed as an elastic cord <figref>56</figref> guided in the form of a cross. The free ends of the securing element <figref>56</figref> by means of openings are <figref>58</figref> on the additional element <figref>32</figref> guided. In this case, on the one hand, is conceivable that the internal stress of the securing element. <figref>56</figref> is so high that the additional part <figref>58</figref> position - and is held captively in the receptacle. On the other hand, would also be possible for the two free ends of the securing means <figref>56</figref> to brace by means of a clamping device, so that the additional part <figref>48</figref> in the receptacle. <figref>41</figref> to secure. In any case, the bending portions <figref>34</figref>, <figref>36</figref> by means of the securing means <figref>56</figref> tensioned against each other, so that these to the additional part <figref>48</figref> are tensioned. The securing means <figref>46</figref> in this case covers a section of the the projection <figref>30</figref> opposite side of the receiving area <figref>41</figref>. This contributes in addition to the loss safety of the additional part <figref>48</figref> in any position of the carrier element. <figref>8</figref> relative to the component in the case of. </p>\n  <p num=\"0041\"><figref>3</figref> shows a in comparison to <figref>2</figref> slightly modified construction. As a securing means <figref>60</figref> in this case instead of a cord are three superimposed velcro tapes for biasing against one another of the bending portions <figref>34</figref>, <figref>36</figref> present. The the projection <figref>30</figref> opposite side is in this case of the securing means <figref>60</figref> not masked, which, however, it would be conceivable. However, the securing means can <figref>60</figref> such a high voltage on the bending portions <figref>34</figref>, <figref>36</figref> application, that the additional part <figref>48</figref> securely in the receiving <figref>41</figref> is mounted. </p>\n  <p num=\"0042\"><figref>4</figref> shows a further embodiment of the holder <figref>2</figref>. In this case, the additional element <figref>62</figref> as a pocket with a closable cover <figref>64</figref> design. In the additional element is, in particular, an additional part which is designed as a power bank <figref>48</figref> can be arranged. The side surfaces <figref>66</figref>, however, the entire additional element <figref>62</figref>, can be elastically resilient, so that additional parts. <figref>48</figref> different sizes lose - and is held securely in the stored therein. In addition, the length of the pocket <figref>62</figref> be adjusted by the cover <figref>64</figref> by means of a hook and loop fastener can be positioned so as to be length-adjustable. </p>\n  <p num=\"0043\">A similar embodiment is described in <figref>5</figref> shown. In this case, the additional element <figref>68</figref> designed as a bag. The bag is by means of clip elements <figref>70</figref>, <figref>72</figref> can be closed, so that it is also an additional part in the present context, such as a power bank, can be stored safely. </p>\n  <p num=\"0044\">Overall, with the present invention, in particular, the possibility is created, a power bank to a holder <figref>2</figref> to be arranged in a captive manner. In particular a cableless or cabled can then also electronic devices, which on the retaining element <figref>4</figref> of the holder <figref>2</figref> are arranged, are charged. Thus, a particularly simple charging mode to a holder for <figref>2</figref> electronic devices is created which are arranged. Conceivable <?page 6?>would also, instead of a power bank other additional parts, such as, for example, an external hard disk, on the coupling element <figref>24</figref> to be arranged.</p>\n  <p><?page 7?>Citations contained in the description</p>\n  <p num=\"0045\">This list of the documents cited by the applicant has been produced in an automated manner and is exclusively for the sake of better information of the reader is recorded. The list is not a component of the german patent - or utility model application. The copper, no adhesion for any errors or omissions.</p>\n  <p>The patent literature cited therein</p>\n  <p num=\"0046\">\n    <ul>\n      <li>De 102010006261 a1 <b>[0001]</b></li>\n    </ul>\n  </p>\n</description>"
  },
  "doc_number": "102016114803",
  "ifi_integrated_content": {
    "1": [],
    "10": [
      "9"
    ],
    "11": [
      "10"
    ],
    "12": [
      "11",
      "8"
    ],
    "13": [
      "1",
      "10",
      "11",
      "12",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9"
    ],
    "14": [
      "13"
    ],
    "15": [
      "1",
      "10",
      "11",
      "12",
      "13",
      "14",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9"
    ],
    "2": [
      "1"
    ],
    "3": [
      "2"
    ],
    "4": [
      "2",
      "3"
    ],
    "5": [
      "1",
      "2",
      "3",
      "4"
    ],
    "6": [
      "4",
      "5"
    ],
    "7": [
      "6"
    ],
    "8": [
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7"
    ],
    "9": [
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8"
    ]
  },
  "international_convention_data": {},
  "kind": "A1",
  "patnum": "DE102016114803A1",
  "publication_id": "174902272"
}
