{
  "claims":[
    {
      "claim_text":"<claim-text>1. A method for delivering from a network server a particular message via a network using a hyper-text transfer protocol, comprising:<claim-text>receiving the particular message, wherein the particular message is addressed to a user;</claim-text><claim-text>writing a particular link to the particular message into a mark-up language file;</claim-text><claim-text>transmitting the mark-up language file from the network server to an application program located on a client device associated with the user, via the network, in accordance with the hyper-text transfer protocol, wherein by the time of the transmitting, the mark-up language file contains links to a plurality of messages, including the particular link to the particular message, wherein further the application program generates a mailbox user interface in response to the mark-up language file to enable the user to browse the plurality of messages, and wherein further, the plurality of messages are stored in a user-associated storage area associated with the network server; and</claim-text><claim-text>in response to the user selecting the particular link via the mailbox user interface, transmitting the particular message to the user'\"'\"'s client device in accordance with the hyper-text transfer protocol.</claim-text></claim-text>",
      "claim_num":1,
      "word_count":334,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>2. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the client device associated with the user comprises a computer.</claim-text>",
      "claim_num":2,
      "word_count":19,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>3. The method as set forth in <claim-ref idref=\"CLM-00002\">claim 2</claim-ref>, wherein the computer includes a display and a keyboard.</claim-text>",
      "claim_num":3,
      "word_count":17,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>4. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the client device associated with the user comprises a handheld device.</claim-text>",
      "claim_num":4,
      "word_count":20,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>5. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the network comprises the Internet.</claim-text>",
      "claim_num":5,
      "word_count":14,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>6. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the network comprises a private network.</claim-text>",
      "claim_num":6,
      "word_count":15,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>7. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the particular message comprises a mark-up language file.</claim-text>",
      "claim_num":7,
      "word_count":17,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>8. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the application program is a hyper-text browser which displays at least part of a content of the particular message in response to user selection of the links contained in the mark-up language file.</claim-text>",
      "claim_num":8,
      "word_count":42,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>9. The method as set forth in <claim-ref idref=\"CLM-00008\">claim 8</claim-ref>, wherein the application program is a web browser which displays at least part of a content of the particular message in response to user selection of the links contained in the mark-up language file.</claim-text>",
      "claim_num":9,
      "word_count":42,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>10. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the network server executes a hyper-text transfer protocol daemon which performs the transmitting.</claim-text>",
      "claim_num":10,
      "word_count":22,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>11. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the network server executes a hyper-text transfer protocol daemon which handles hyper-text transfer protocol interactions between the network server and the client device associated with the user.</claim-text>",
      "claim_num":11,
      "word_count":36,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>12. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein:<claim-text>the network server executes a hyper-text transfer protocol daemon;</claim-text><claim-text>the application program is a browser; and</claim-text><claim-text>wherein the hyper-text transfer protocol daemon performs the transmitting by transmitting the mark-up language file to the browser.</claim-text></claim-text>",
      "claim_num":12,
      "word_count":71,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>13. The method as set forth in <claim-ref idref=\"CLM-00012\">claim 12</claim-ref>, wherein the browser comprises a hyper-text browser.</claim-text>",
      "claim_num":13,
      "word_count":15,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>14. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the network server comprises an HTTP server and the client device associated with the user comprises an HTTP client.</claim-text>",
      "claim_num":14,
      "word_count":28,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>15. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the particular message is received in a first file format, and further comprising converting the particular message from the first file format to a second file format, wherein the second file format comprises a mark-up language file format.</claim-text>",
      "claim_num":15,
      "word_count":47,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>16. The method as set forth in <claim-ref idref=\"CLM-00015\">claim 15</claim-ref>, wherein the network server executes a second application program and an HTTP daemon (HTTPD), and wherein the second application program performs the converting, and the HTTPD performs the transmitting.</claim-text>",
      "claim_num":16,
      "word_count":37,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>17. The method as set forth in <claim-ref idref=\"CLM-00016\">claim 16</claim-ref>, wherein the HTTPD establishes an HTTP application layer session between the second application program executing on the network server and a hyper-text browser executing on the client device associated with the user.</claim-text>",
      "claim_num":17,
      "word_count":40,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>18. The method as set forth in <claim-ref idref=\"CLM-00017\">claim 17</claim-ref>, wherein the client device associated with the user comprises a computer.</claim-text>",
      "claim_num":18,
      "word_count":19,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>19. The method as set forth in <claim-ref idref=\"CLM-00018\">claim 18</claim-ref>, wherein the computer includes a display and a keyboard.</claim-text>",
      "claim_num":19,
      "word_count":17,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>20. The method as set forth in <claim-ref idref=\"CLM-00018\">claim 18</claim-ref>, wherein the client device associated with the user comprises a handheld device.</claim-text>",
      "claim_num":20,
      "word_count":20,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>21. The method as set forth in <claim-ref idref=\"CLM-00018\">claim 18</claim-ref>, wherein the network comprises the Internet.</claim-text>",
      "claim_num":21,
      "word_count":14,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>22. The method as set forth in <claim-ref idref=\"CLM-00018\">claim 18</claim-ref>, wherein the network comprises a private network.</claim-text>",
      "claim_num":22,
      "word_count":15,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>23. The method as set forth in <claim-ref idref=\"CLM-00018\">claim 18</claim-ref>, wherein the particular message comprises an HTML file.</claim-text>",
      "claim_num":23,
      "word_count":16,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>24. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, further comprising, after the receiving and before the transmitting, storing the particular message in the user-associated storage area associated with the network server.</claim-text>",
      "claim_num":24,
      "word_count":31,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>25. The method as set forth in <claim-ref idref=\"CLM-00024\">claim 24</claim-ref>, wherein the user-associated storage area comprises a restricted access message storage area.</claim-text>",
      "claim_num":25,
      "word_count":20,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>26. The method as set forth in <claim-ref idref=\"CLM-00025\">claim 25</claim-ref>, wherein the user-associated message storage area comprises a mailbox having an associated URL.</claim-text>",
      "claim_num":26,
      "word_count":21,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>27. The method as set forth in <claim-ref idref=\"CLM-00026\">claim 26</claim-ref>, wherein the application program is a hypertext browser that enables the user to access the mailbox using the URL.</claim-text>",
      "claim_num":27,
      "word_count":27,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>28. The method as set forth in <claim-ref idref=\"CLM-00027\">claim 27</claim-ref>, wherein the particular message is received in a first file format, and further comprising converting the particular message from the first file format to a second file format, wherein the second file format comprises the format of the mark-up language file.</claim-text>",
      "claim_num":28,
      "word_count":49,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>29. The method as set forth in <claim-ref idref=\"CLM-00028\">claim 28</claim-ref>, wherein the network server executes a second application program and an HTTP daemon (HTTPD), and wherein the second application program performs the converting, and the HTTPD performs the transmitting and processing of user URL access requests to the mailbox.</claim-text>",
      "claim_num":29,
      "word_count":47,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>30. The method as set forth in <claim-ref idref=\"CLM-00029\">claim 29</claim-ref>, wherein the HTTPD performs the transmitting by transmitting the mark-up language file to the hyper-text browser.</claim-text>",
      "claim_num":30,
      "word_count":24,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>31. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the particular message comprises a mark-up language file that conforms with a dialect of a standardized generalized mark-up language (SGML).</claim-text>",
      "claim_num":31,
      "word_count":29,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>32. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the particular message comprises a standardized generalized mark-up language (SGML) file.</claim-text>",
      "claim_num":32,
      "word_count":20,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>33. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the particular message is received in a first file format other than a mark-up language file format, and, further comprising converting a file format of the received message from the first file format to the mark-up language file format.</claim-text>",
      "claim_num":33,
      "word_count":48,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>34. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the particular message comprises a voice mail message.</claim-text>",
      "claim_num":34,
      "word_count":17,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>35. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the particular message comprises a facsimile message.</claim-text>",
      "claim_num":35,
      "word_count":16,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>36. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the particular message comprises a data message.</claim-text>",
      "claim_num":36,
      "word_count":16,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>37. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, further comprising sending a notification to the user to notify the user that the particular message has been received.</claim-text>",
      "claim_num":37,
      "word_count":27,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>38. The method as set forth in <claim-ref idref=\"CLM-00037\">claim 37</claim-ref>, wherein the notification comprises an e-mail message.</claim-text>",
      "claim_num":38,
      "word_count":15,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>39. The method as set forth in <claim-ref idref=\"CLM-00037\">claim 37</claim-ref>, wherein the notification comprises a wireless notification.</claim-text>",
      "claim_num":39,
      "word_count":15,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>40. The method as set forth in <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the user-associated storage area comprises a user-specific message mailbox within a messaging database comprising a plurality of mailboxes for a plurality of users.</claim-text>",
      "claim_num":40,
      "word_count":32,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>41. A method for delivering a particular message addressed to an intended recipient from a network server to the intended recipient'\"'\"'s computer, the method comprising:<claim-text>receiving the particular message, wherein the particular message is addressed to the intended recipient;</claim-text><claim-text>writing a particular link to the particular message into a mark-up language file;</claim-text><claim-text>establishing a user-authenticated hypertext transfer protocol connection, over the Internet, between the intended recipient'\"'\"'s computer and the network server; and</claim-text><claim-text>transmitting the mark-up language file from the network server to a browser program executing on the intended recipient'\"'\"'s computer over the Internet, via the hypertext transfer protocol connection, wherein by the time of the transmitting, the markup language file contains links to a plurality of messages, including the particular link to the particular message, and wherein further the browser program produces a graphical user interface in response to the mark-up language file, the graphical user interface enabling the intended recipient to request delivery of the particular message from a user-associated storage area associated with the network server; and</claim-text><claim-text>in response to the intended recipient selecting the particular link via the graphical user interface, transmitting the particular message to the intended recipient'\"'\"'s computer via the user-authenticated hypertext transfer protocol connection.</claim-text></claim-text>",
      "claim_num":41,
      "word_count":366,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>42. The method as set forth in <claim-ref idref=\"CLM-00041\">claim 41</claim-ref>, further comprising sending a notification to the user to notify the user that the particular message has been received.</claim-text>",
      "claim_num":42,
      "word_count":27,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>43. The method as set forth in <claim-ref idref=\"CLM-00042\">claim 42</claim-ref>, wherein the notification comprises an e-mail message.</claim-text>",
      "claim_num":43,
      "word_count":15,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>44. The method as set forth in <claim-ref idref=\"CLM-00042\">claim 42</claim-ref>, wherein the user-associated storage area is a restricted access storage area of the storage medium allocated to the intended recipient.</claim-text>",
      "claim_num":44,
      "word_count":28,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>45. The method as set forth in <claim-ref idref=\"CLM-00044\">claim 44</claim-ref>, wherein the graphical user interface provides an indication of the plurality of messages stored in the restricted access storage area allocated to the intended recipient.</claim-text>",
      "claim_num":45,
      "word_count":33,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>46. The method as set forth in <claim-ref idref=\"CLM-00042\">claim 42</claim-ref>, wherein the notification comprises a wireless notification.</claim-text>",
      "claim_num":46,
      "word_count":15,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>47. The method as set forth in <claim-ref idref=\"CLM-00041\">claim 41</claim-ref>, wherein the particular message comprises an HTML file.</claim-text>",
      "claim_num":47,
      "word_count":16,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>48. The method as set forth in <claim-ref idref=\"CLM-00041\">claim 41</claim-ref>, wherein the browser program comprises a hyper-text browser.</claim-text>",
      "claim_num":48,
      "word_count":16,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>49. The method as set forth in <claim-ref idref=\"CLM-00041\">claim 41</claim-ref>, wherein the browser program comprises a web browser.</claim-text>",
      "claim_num":49,
      "word_count":16,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>50. The method as set forth in <claim-ref idref=\"CLM-00041\">claim 41</claim-ref>, wherein the particular link comprises a hyper-text link which can be activated by the intended recipient to download the particular message from the network server to the intended recipient'\"'\"'s computer.</claim-text>",
      "claim_num":50,
      "word_count":38,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>51. A method for delivering a particular message addressed to an intended recipient to the intended recipient'\"'\"'s user device, comprising:<claim-text>receiving, at the intended recipient'\"'\"'s user device, the particular message, wherein the particular message is addressed to the intended recipient;</claim-text><claim-text>storing, at a remote server, the particular message in a user-associated storage area allocated to the intended recipient;</claim-text><claim-text>writing a particular link to the particular message into a mark-up language file;</claim-text><claim-text>establishing a user-authenticated hypertext transfer protocol connection, over a network, between the intended recipient'\"'\"'s user device and the remote server; and</claim-text><claim-text>transmitting the mark-up language file from the remote server to the intended recipient'\"'\"'s user device, over the network, via the hypertext transfer protocol connection, wherein by the time of the transmitting, the markup language file contains links to a plurality of messages, including the particular link to the particular message, and wherein further an application program executing on the user device generates, in response to the mark-up language file, a mailbox user interface to enable the intended recipient to access the particular message stored in the user-associated storage area; and</claim-text><claim-text>in response to the intended recipient selecting the particular link via the mailbox user interface, transmitting the message to the intended recipient'\"'\"'s user device via the user-authenticated hypertext transfer protocol connection.</claim-text></claim-text>",
      "claim_num":51,
      "word_count":393,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>52. A method of accessing a particular message addressed to a user via a network server and via a network using a hyper-text transfer protocol, comprising:<claim-text>receiving, at a client device, in accordance with the hyper-text transfer protocol, a mark-up language file from the network server;</claim-text><claim-text>producing, at the client device, in response to the mark-up language file, a graphical user interface that enables the user to access the particular message from the network server, and to browse a plurality of messages stored in a user-associated area of the network server;</claim-text><claim-text>transmitting, in accordance with the hyper-text transfer protocol, a request from the client device to the network server, wherein the request is responsive to the user selecting a particular link in the markup language file via the graphical user interface, and the request is indicative of the user'\"'\"'s desire to access the particular message, and wherein further the user is associated with the client device; and</claim-text><claim-text>responsive to the request, receiving the particular message from the network server at the client device, via the network, in accordance with the hyper-text transfer protocol,</claim-text><claim-text>wherein the particular link to the particular message is written into the mark-up language file, and by the time of the receiving of the mark-up language file at the client device, the markup language file contains links to the plurality of messages, including the particular link to the particular message.</claim-text></claim-text>",
      "claim_num":52,
      "word_count":429,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>53. A method, comprising:<claim-text>receiving a particular message addressed to an intended recipient;</claim-text><claim-text>storing the particular message in a user-associated storage area associated with a network server and allocated to the intended recipient;</claim-text><claim-text>writing a particular link to the particular message into a mark-up language file;</claim-text><claim-text>transmitting, in accordance with the hyper-text transfer protocol, the mark-up language file from the network server to a client device, wherein by the time of the transmitting, the mark-up language file contains links to a plurality of messages, including the particular link to the particular message;</claim-text><claim-text>the network server receiving a request from a user application program executing on the client device, via a network, wherein the request comprises a request to retrieve the particular message and is directed to an application layer address which is used to locate the particular message using at least a portion of the particular link; and</claim-text><claim-text>in response to the request, transmitting the particular message from the network server to the user application program, via the network,</claim-text><claim-text>wherein the network server and the user application program communicate using an application layer communication protocol as application layer peer endpoints, and the user application program produces, in response to the mark-up language file, a mailbox user interface that enables the intended recipient to select the links to the plurality of messages via the mailbox user interface, and the particular link comprises a link to the application layer address of the particular message in the user-associated storage area.</claim-text></claim-text>",
      "claim_num":53,
      "word_count":475,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>54. The method a set forth in <claim-ref idref=\"CLM-00053\">claim 53</claim-ref>, wherein the application layer communication protocol comprises a hyper-text transfer protocol.</claim-text>",
      "claim_num":54,
      "word_count":19,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>55. The method as set forth in <claim-ref idref=\"CLM-00053\">claim 53</claim-ref>, wherein the packet switched data network comprises the Internet. </claim-text>",
      "claim_num":55,
      "word_count":17,
      "depends_on":null
    }
  ],
  "abstract":{
    "abstract_text":"<p num=\"p-0001\">A Message Storage and Deliver System (MSDS) is connected to the public switched telephone network (PSTN) and receives incoming calls with these calls being facsimile, voice, or data transmissions. The MSDS detects the type of call and stores the message signal in a database. The MSDS is also connected to the Internet and has a hyper-text transfer protocol deamon (HTTPD) for receiving requests from users. The HTTPD forwards requests for certain files or messages to a network server which transmits at least part of the message to the HTTPD and then to the user. In addition to requests for certain documents, the HTTPD may also receive a request in the form of a search query. The search query is forwarded from the HTTPD to an application program for conducting the search of the database. The results of the search are forwarded through the HTTPD to the user. The user may then select one or more files or messages from the search results and may save the search for later reference.</p>"
  },
  "description":{
    "description_text":"<description mxw-id=\"PDES40839752\" lang=\"EN\" load-source=\"patent-office\">\n  <?RELAPP description=\"Other Patent Relations\" end=\"lead\"?>\n  <p num=\"p-0002\">This is a continuation of application Ser. No. 10/436,798 filed 12 May 2003 now U.S. Pat. No. 6,857,074, which is a continuation of application Ser. No. 09/840,759 filed 23 Apr. 2001, U.S. Pat. No. 6,564,321, which is a continuation of application Ser. No. 09/186,595 filed 5 Nov. 1998, U.S. Pat. No. 6,350,066, which is a continuation of application Ser. No. 08/944,741 filed 6 Oct. 1997, U.S. Pat. No. 5,870,549, which is a continuation-in-part of application Ser. No. 08/431,716 filed 28 Apr. 1995, U.S. Pat. No. 5,675,507.</p>\n  <?RELAPP description=\"Other Patent Relations\" end=\"tail\"?>\n  <?BRFSUM description=\"Brief Summary\" end=\"lead\"?>\n  <heading>FIELD OF THE INVENTION</heading>\n  <p num=\"p-0003\">This invention relates to system(s) and method(s) for storing and delivering messages and, more particularly, to system(s) and method(s) for storing messages and for delivery the messages through a network, such as the Internet, or a telephone line to an intended recipient. In another aspect, the invention relates to system(s) and method(s) for storing, delivering, and managing messages or other files, such as for archival purposes or for document tracking.</p>\n  <heading>BACKGROUND OF THE INVENTION</heading>\n  <p num=\"p-0004\">Even though the facsimile machine is heavily relied upon by businesses of all sizes and is quickly becoming a standard piece of office equipment, many businesses or households cannot receive the benefits of the facsimile machine. Unfortunately, for a small business or for a private household, a facsimile machine is a rather expensive piece of equipment. In addition to the cost of purchasing the facsimile machine, the facsimile machine also requires toner, paper, maintenance, as well as possible repairs. These expenses may be large enough to prevent many of the small businesses and certainly many households from benefiting from the service that the facsimile machine can provide. For others who are constantly traveling and who do not have an office, it may be impractical to own a facsimile machine. In fact, the Atlanta Business Chronicle estimates that 30% of the small businesses do not have any facsimile machines. Therefore, many businesses and households are at a disadvantage since they do not have access to a facsimile machine.</p>\n  <p num=\"p-0005\">Because a facsimile machine can be such an asset to a company and is heavily relied upon to quickly transmit and receive documents, a problem exists in that the machines are not always available to receive a facsimile message. At times, a facsimile machine may be busy receiving another message or the machine may be transmitting a message of its own. During these times, a person must periodically attempt to send the message until communication is established with the desired facsimile machine. This inability to connect with a facsimile machine can be frustrating, can consume quite a bit of the person'\"'\"'s time, and prevent the person from performing more productive tasks. While some more advanced facsimile machines will retry to establish communication a number of times, a person will still have to check on the facsimile machine to ensure that the message was transmitted or to re-initiate the transmission of the message.</p>\n  <p num=\"p-0006\">In addition to labor costs and a reduction in office efficiency, a facsimile machine may present costs to businesses that are not readily calculated. These costs include the loss of business or the loss of goodwill that occurs when the facsimile machine is not accessible by another facsimile machine. These costs can occur for various reasons, such as when the facsimile machine is out of paper, when the machine needs repairing, or when the facsimile machine is busy with another message. These costs occur more frequently with some of the smaller businesses, who are also less able to incur these expenses, since many of them have a single phone line for a telephone handset and the facsimile machine and thereby stand to lose both telephone calls and facsimile messages when the single line is busy. In fact, the Atlanta Business Chronicle estimated that fewer than 5% of the small businesses have 2 or more facsimile machines. Many of the larger companies can reduce these losses by having more than one facsimile machine and by having calls switched to another machine when one of the machines is busy. These losses, however, cannot be completely eliminated since the machines can still experience a demand which exceeds their capabilities.</p>\n  <p num=\"p-0007\">A main benefit of the facsimile machine, namely the quick transfer of documents, does not necessarily mean that the documents will quickly be routed to the intended recipient. The facsimile machines may be unattended and a received facsimile message may not be noticed until a relatively long period of time has elapsed. Further, even for those machines which are under constant supervision, the routing procedures established in an office may delay the delivery of the documents. It is therefore a problem in many offices to quickly route the facsimile message to the intended recipient.</p>\n  <p num=\"p-0008\">The nature of the facsimile message also renders it difficult for the intended recipient to receive a sensitive message without having the message exposed to others in the office who can intercept and read the message. If the intended recipient is unaware that the message is being sent, other people may see the message while it is being delivered or while the message remains next to the machine. When the intended recipient is given notice that a sensitive message is being transmitted, the intended recipient must wait near the facsimile machine until the message is received. It was therefore difficult to maintain the contents of a facsimile message confidential.</p>\n  <p num=\"p-0009\">In an office with a large number of employees, it may also be difficult to simply determine where the facsimile message should be routed. In light of this difficulty, some systems have been developed to automatically route facsimile messages to their intended recipient. One type of system, such as the one disclosed in U.S. Pat. No. 5,257,112 to Okada, can route an incoming call to a particular facsimile machine based upon codes entered with telephone push-buttons by the sender of the message. Another type of system, such as the one disclosed in U.S. Pat. No. 5,115,326 to Burgess et al. or in U.S. Pat. No. 5,247,591 to Baran, requires the sender to use a specially formatted cover page which is read by the system. This type of system, however, burdens the sender, who may very well be a client or customer, by requiring the sender to take special steps or additional steps to transmit a facsimile message. These systems are therefore not very effective or desirable.</p>\n  <p num=\"p-0010\">Another type of routing system links a facsimile machine to a Local Area Network (LAN) in an office. For instance, in the systems disclosed in the patents to Baran and Burgess et al., after the system reads the cover sheet to determine the intended recipient of the facsimile message, the systems send an E-mail message to the recipient through the local network connecting the facsimile machine to the recipient'\"'\"'s computer. Other office systems, such as those in U.S. Pat. No. 5,091,790 to Silverberg and U.S. Pat. No. 5,291,546 to Giler et al., are linked to the office'\"'\"'s voice mail system and may leave a message with the intended recipient that a facsimile message has been received. Some systems which are even more advanced, such as those in U.S. Pat. No. 5,317,628 to Misholi et al. and U.S. Pat. No. 5,333,266 to Boaz et al., are connected to an office'\"'\"'s local network and provide integrated control of voice messages, E-mail messages, and facsimile messages.</p>\n  <p num=\"p-0011\">The various systems for routing facsimile messages, and possibly messages of other types received in the office, are very sophisticated and expensive systems. While these office systems are desirable in that they can effectively route the messages at the office to their intended recipients, the systems are extremely expensive and only those companies with a great number of employees can offset the costs of the system with the benefits that the system will provide to their company. Thus, for most businesses, it still remains a problem to effectively and quickly route messages to the intended recipients. It also remains a problem for most businesses to route the messages in a manner which can preserve the confidential nature of the messages.</p>\n  <p num=\"p-0012\">Even for the businesses that have a message routing system and especially for those that do not have any type of system, it is usually difficult for a person to retrieve facsimile messages while away from the office. Typically, a person away on business must call into the office and be informed by someone in the office as to the facsimile messages that have been received. Consequently, the person must call into the office during normal business hours while someone is in the office and is therefore limited in the time that the information in a facsimile message can be relayed.</p>\n  <p num=\"p-0013\">If the person away on business wants to look at the facsimile message, someone at the office must resend the message to a facsimile machine accessible to that person. Since this accessible machine is often a facsimile machine at another business or at a hotel where the person is lodging, it is difficult for the person to receive the facsimile message without risking disclosure of its contents. Further, since someone at the person'\"'\"'s office must remember to send the message and since someone at the accessible facsimile machine must route the message to the person away from the office, the person may not receive all of the facsimile messages or may have to wait to receive the messages.</p>\n  <p num=\"p-0014\">The retrieval of facsimile messages, as well as voice mail messages, while away from the office is not without certain costs. For one, the person often must incur long distance telephone charges when the person calls the office to check on the messages and to have someone in the office send the messages to another facsimile. The person will then incur the expenses of transmitting the message to a fax bureau or hotel desk as well as the receiving location'\"'\"'s own charges for use of their equipment. While these charges are certainly not substantial, the charges are nonetheless expenses incurred while the person is away from the office.</p>\n  <p num=\"p-0015\">Overall, while the facsimile machine is an indispensable piece of equipment for many businesses, the facsimile machine presents a number of problems or costs. Many businesses or households are disadvantaged since they are unable to reap the benefits of the facsimile machine. For the businesses that do have facsimile machines, the businesses must incur the normal costs of operating the facsimile machine in addition to the costs that may be incurred when the facsimile machine or machines are unable to receive a message. Further, the facsimile messages may not be efficiently or reliably routed to the intended recipient and may have its contents revealed during the routing process. The costs and problems in routing a facsimile message are compounded when the intended recipient is away from the office.</p>\n  <p num=\"p-0016\">Many of the problems associated with facsimile messages are not unique to just facsimile messages but are also associated with voice mail messages and data messages. With regard to voice messages, many businesses do not have voice mail systems and must write the message down. Thus, the person away from the office must call in during normal office hours to discover who has called. The information in these messages are usually limited to just the person who called, their number, and perhaps some indication as to the nature of the call. For those businesses that have voice mail, the person away from the office must call in and frequently incur long distance charges. Thus, there is a need for a system for storing and delivery voice messages which can be easily and inexpensively accessed at any time.</p>\n  <p num=\"p-0017\">With regard to data messages, the transmission of the message often requires some coordination between the sender and the recipient. For instance, the recipient'\"'\"'s computer must be turned on to receive the message, which usually occurs only when someone is present during normal office hours. Consequently, the recipient'\"'\"'s computer is usually only able to receive a data message during normal office hours. Many households and also businesses may not have a dedicated data line and must switch the line between the phone, computer, and facsimile. In such a situation, the sender must call and inform the recipient to switch the line over to the computer and might have to wait until the sender can receive the message. The retransmission of the data message to another location, such as when someone is away from the office, only further complicates the delivery. It is therefore frequently difficult to transmit and receive data messages and is also difficult to later relay the messages to another location.</p>\n  <p num=\"p-0018\">A standard business practice of many companies is to maintain records of all correspondence between itself and other entities. Traditionally, the correspondence that has been tracked and recorded includes letters or other such printed materials that is mailed to or is from a company to the other entity. Although tracking correspondence of printed materials is relatively easy, non-traditional correspondence, such as facsimile messages, e-mail messages, voice messages, or data messages, are more difficult to track and record.</p>\n  <p num=\"p-0019\">For example, facsimile messages may be difficult to track and record since the messages may be received on thermal paper, which suffers from a disadvantage that the printing fades over time. Also, accurate tracking of facsimile messages is difficult since the facsimile messages may only be partially printed at the facsimile machine or the messages may be lost or only partially delivered to their intended recipients. Facsimile messages also present difficulties since they are often delivered within an organization through different channels than ordinary mail and thus easily fall outside the normal record keeping procedures of the company.</p>\n  <p num=\"p-0020\">Voice mail messages are also difficult to track and record. Although voice messages can be saved, many voice mail servers automatically delete the messages after a certain period of time. To maintain a permanent record of a voice message, the voice message may be transcribed and a printed copy of the message may be kept in the records. This transcribed copy of the voice message, however, is less credible and thus less desirable than the original voice message since the transcribed copy may have altered material or may omit certain portions of the message.</p>\n  <p num=\"p-0021\">In addition to facsimile and voice mail messages, data messages are also difficult to track and record. A download or upload of a file may only be evident by the existence of a file itself. A file transfer procedure normally does not lend itself to any permanent record of what file was transferred, the dialed telephone number, the telephone number of the computer receiving the file, the time, or the date of the transfer. It is therefore difficult to maintain accurate records of all data transfers between itself and another entity.</p>\n  <heading>SUMMARY OF THE INVENTION</heading>\n  <p num=\"p-0022\">It is an object of the invention to reliably and efficiently route messages to an intended recipient.</p>\n  <p num=\"p-0023\">It is another object of the invention to route messages to the intended recipient while maintaining the contents of the message confidential.</p>\n  <p num=\"p-0024\">It is another object of the invention to enable the intended recipient to access the messages easily and with minimal costs.</p>\n  <p num=\"p-0025\">It is a further object of the invention to permit the simultaneous receipt of more than one message on behalf of the intended recipient.</p>\n  <p num=\"p-0026\">It is a further object of the invention to enable the intended recipient of a message to access the message at any time and at virtually any location world-wide.</p>\n  <p num=\"p-0027\">It is yet a further object of the invention to enable the intended recipient of a message to browse through the received messages.</p>\n  <p num=\"p-0028\">It is yet a further object of the invention to quickly notify an intended recipient that a message has been received.</p>\n  <p num=\"p-0029\">It is still another object of the invention to receive messages of various types.</p>\n  <p num=\"p-0030\">It is still another object of the invention to deliver messages according to the preferences of the intended recipient.</p>\n  <p num=\"p-0031\">It is still a further object of the invention to record and track correspondence, such as facsimile messages, voice mail messages, and data transfers.</p>\n  <p num=\"p-0032\">Additional objects, advantages and novel features of the invention will be set forth in the description which follows, and will become apparent to those skilled in the art upon reading this description or practicing the invention. The objects and advantages of the invention may be realized and attained by the appended claims.</p>\n  <p num=\"p-0033\">To achieve the foregoing and other objects, in accordance with the present invention, as embodied and broadly described herein, a system and method for storing and delivering messages involves receiving an incoming call and detecting an address signal associated with the incoming call, the address signal being associated with a user of the message storage and delivery system. A message accompanied with the address signal is then received and converted from a first file format to a second file format. The message is stored in the second file format within a storage area and is retrieved after a request has been received from the user. At least a portion of the message is then transmitted to the user over a network with the second file format being a mixed media page layout language.</p>\n  <p num=\"p-0034\">In another aspect, a network message storage and delivery system comprises a central processor for receiving an incoming call, for detecting an address signal on the incoming call, for detecting a message on the incoming call, and for placing the message in a storage area. The address signal on the incoming call is associated with a user of the network message storage and delivery system. A network server receives the message from the storage area, converts the message into a mixed media page layout language, and places the message in the storage area. When the network server receives a request from the user over the network, the network server transmits at least a portion of the message over the network to the user.</p>\n  <p num=\"p-0035\">Preferably, the network storage and delivery system can receive facsimile messages, data messages, or voice messages and the network is the Internet. The messages are converted into a standard generalized mark-up language and the user is notified that a message has arrived through E-mail or through a paging system. A listing of the facsimile messages may be sent to the user in one of several formats. These formats include a textual only listing or a listing along with a full or reduced size image of the first page of each message. A full or reduced size image of each page of a message in the listing may alternatively be presented to the user.</p>\n  <p num=\"p-0036\">According to a further aspect, the invention relates to a system and method for managing files or messages and involves storing message signals in storage and receiving requests from a user for a search. The search preferably comprises a search query that is completed by a user and supplied to a hyper-text transfer protocol deamon (HTTPD) in the system. The HTTPD transfers the request through a common gateway interface (CGI) to an application program which conducts the search. The results of the search are preferably returned through the HTTPD to the computer in the form of a listing of all messages or files satisfying the search parameters. The user may then select one or more of the listed messages or files and may save the search for later references.</p>\n  <?BRFSUM description=\"Brief Summary\" end=\"tail\"?>\n  <?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"lead\"?>\n  <description-of-drawings>\n    <heading>BRIEF DESCRIPTION OF THE DRAWINGS</heading>\n    <p num=\"p-0037\">The accompanying drawings, which are incorporated in, and form a part of, the specification, illustrate an embodiment of the present invention and, together with the description, serve to explain the principles of the invention. In the drawings:</p>\n    <p num=\"p-0038\"><figref idrefs=\"DRAWINGS\">FIG. 1</figref> is a block diagram illustrating the connections of a message storage and delivery system MSDS;</p>\n    <p num=\"p-0039\"><figref idrefs=\"DRAWINGS\">FIG. 2</figref> is an overall flow chart of operations for transmitting a message to the MSDS of <figref idrefs=\"DRAWINGS\">FIG. 1</figref>;</p>\n    <p num=\"p-0040\"><figref idrefs=\"DRAWINGS\">FIG. 3</figref> is an overall flow chart of operations for receiving a message stored at the MSDS of <figref idrefs=\"DRAWINGS\">FIG. 1</figref>;</p>\n    <p num=\"p-0041\"><figref idrefs=\"DRAWINGS\">FIGS. 4(A)</figref> and (B) are flowcharts of operations for generating HTML files according to user preferences;</p>\n    <p num=\"p-0042\"><figref idrefs=\"DRAWINGS\">FIG. 5</figref> is a flowchart of operations for generating requested information;</p>\n    <p num=\"p-0043\"><figref idrefs=\"DRAWINGS\">FIG. 6</figref> is a flowchart of operations for converting a facsimile message into HTML files;</p>\n    <p num=\"p-0044\"><figref idrefs=\"DRAWINGS\">FIG. 7</figref> is an exemplary display of a first page of a facsimile message according to a fourth display option;</p>\n    <p num=\"p-0045\"><figref idrefs=\"DRAWINGS\">FIG. 8</figref> is a flowchart of operations for converting a voice message into an HTML file;</p>\n    <p num=\"p-0046\"><figref idrefs=\"DRAWINGS\">FIG. 9</figref> is a flowchart of operations for converting a data message into an HTML file;</p>\n    <p num=\"p-0047\"><figref idrefs=\"DRAWINGS\">FIG. 10</figref> is a flowchart of operations for detecting a type of call received at the MSDS <b>10</b>;</p>\n    <p num=\"p-0048\"><figref idrefs=\"DRAWINGS\">FIG. 11</figref> is a flowchart of operations for receiving voice messages;</p>\n    <p num=\"p-0049\"><figref idrefs=\"DRAWINGS\">FIG. 12</figref> is a flowchart of operations for interacting with an owner'\"'\"'s call;</p>\n    <p num=\"p-0050\"><figref idrefs=\"DRAWINGS\">FIG. 13</figref> is a more detailed block diagram of the MSDS <b>10</b>;</p>\n    <p num=\"p-0051\"><figref idrefs=\"DRAWINGS\">FIG. 14</figref> is a block diagram of the central processor in <figref idrefs=\"DRAWINGS\">FIG. 13</figref>;</p>\n    <p num=\"p-0052\"><figref idrefs=\"DRAWINGS\">FIG. 15</figref> is a block diagram of the Internet Server of <figref idrefs=\"DRAWINGS\">FIG. 13</figref>;</p>\n    <p num=\"p-0053\"><figref idrefs=\"DRAWINGS\">FIGS. 16(A) and 16(B)</figref> depict possible software layers for the Internet Server of <figref idrefs=\"DRAWINGS\">FIG. 13</figref>;</p>\n    <p num=\"p-0054\"><figref idrefs=\"DRAWINGS\">FIG. 17</figref> is a diagram of a data entry for a message signal;</p>\n    <p num=\"p-0055\"><figref idrefs=\"DRAWINGS\">FIG. 18</figref> is a flowchart of a process for sending a search query, for conducting a search, and for returning results of the search to a computer through the Internet;</p>\n    <p num=\"p-0056\"><figref idrefs=\"DRAWINGS\">FIG. 19</figref> is an example of a search query form for defining a desired search;</p>\n    <p num=\"p-0057\"><figref idrefs=\"DRAWINGS\">FIG. 20</figref> is an example of a completed search query;</p>\n    <p num=\"p-0058\"><figref idrefs=\"DRAWINGS\">FIG. 21</figref> is an example of a set of search results returned to the computer in response to the search query of <figref idrefs=\"DRAWINGS\">FIG. 20</figref>; and</p>\n    <p num=\"p-0059\"><figref idrefs=\"DRAWINGS\">FIG. 22</figref> is an example of a listing of stored searches.</p>\n  </description-of-drawings>\n  <?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"tail\"?>\n  <?DETDESC description=\"Detailed Description\" end=\"lead\"?>\n  <heading>DETAILED DESCRIPTION OF THE PREFERRED EMBODIMENTS</heading>\n  <p num=\"p-0060\">Reference will now be made in detail to the preferred embodiments of the invention, examples of which are illustrated in the accompanying drawings.</p>\n  <p num=\"p-0061\">With reference to <figref idrefs=\"DRAWINGS\">FIG. 1</figref>, a message storage and delivery system (MSDS) <b>10</b> is connected to a central office <b>20</b> of the telephone company through at least one direct inward dialing (DID) trunk <b>15</b>. With each call on the DID trunk <b>15</b>, an address signal indicating the telephone number being called is provided to the MSDS <b>10</b>. The DID trunk <b>15</b> can carry a large number of telephone numbers or addresses. Preferably, the DID trunk <b>15</b> comprises a number of DID trunks <b>15</b> connected in parallel between the central office <b>20</b> and the MSDS so that the MSDS <b>10</b> can simultaneously receive more than one call and, moreover, can simultaneously receive more than one call for a single telephone number or address.</p>\n  <p num=\"p-0062\">The central office <b>20</b> is connected to a number of third parties. For instance, the central office <b>20</b> may be connected to a facsimile machine <b>24</b>, a telephone set <b>26</b>, and to a computer <b>28</b> with each connection being made through a separate telephone line. While a single computer <b>28</b> is shown in the figure, the single computer <b>28</b> may actually represent a local area network which is connected through the central office <b>20</b> to the MSDS <b>10</b>. Although the facsimile machine <b>24</b>, telephone set <b>26</b>, and computer <b>28</b> have been shown on separate lines, it should be understood that one or more of these devices could share a single line.</p>\n  <p num=\"p-0063\">The MSDS <b>10</b> is also connected to a network, preferably the Internet World Wide Web <b>30</b>. Although the Internet <b>30</b> has been shown as a single entity, it should be understood that the Internet <b>30</b> is actually a conglomeration of computer networks and is a constantly evolving and changing structure. The MSDS <b>10</b> therefore is not limited to the current structure or form of the Internet <b>30</b> but encompasses any future changes or additions to the Internet <b>30</b>. Further, the MSDS <b>10</b> is shown as being directly connected to the Internet <b>30</b>, such as through its own node or portal. The MSDS <b>10</b>, however, may be practiced with any suitable connection to the Internet <b>30</b>, such as through an intermediate Internet access provider.</p>\n  <p num=\"p-0064\">With reference to <figref idrefs=\"DRAWINGS\">FIG. 2</figref> depicting an overall operation of the invention, a telephone call directed to a number serviced by the MSDS <b>10</b> is initiated at step <b>40</b> by a third party, for instance, through the facsimile machine <b>24</b>, telephone set <b>26</b>, or computer <b>28</b>. The incoming telephone call may therefore carry a facsimile message, a voice message, or a data message. At step <b>42</b>, the address signal associated with the initiated call is routed through the central office <b>20</b>, over the DID trunk <b>15</b>, and to the MSDS <b>10</b>.</p>\n  <p num=\"p-0065\">When the call reaches the MSDS <b>10</b>, the call is routed within the MSDS <b>10</b> in a manner that will be described in more detail below with reference to <figref idrefs=\"DRAWINGS\">FIG. 13</figref>. At step <b>46</b>, the MSDS <b>10</b> answers the telephone call and receives the address signal from the DID trunk <b>15</b>. Next, at step <b>48</b>, the call is established between the MSDS <b>10</b> and the third party and, at step <b>50</b>, the MSDS <b>10</b> receives the message transmitted over the telephone line. The message is stored at step <b>52</b>, a database within the MSDS <b>10</b> is updated at step <b>54</b>, and the intended recipient of the message is notified at step <b>56</b>. The intended recipient of the message uses the services provided by the MSDS <b>10</b> and will hereinafter be referred to as a user. At step <b>58</b>, the message is converted into hyper-text mark-up language (HTML).</p>\n  <p num=\"p-0066\">After the MSDS <b>10</b> receives a message for one of its users, the user can then communicate with the MSDS <b>10</b> at any time and at any location by connecting to the Internet World Wide Web <b>30</b> and retrieving the message stored within the MSDS <b>10</b>. With reference to <figref idrefs=\"DRAWINGS\">FIG. 3</figref>, at step <b>60</b> the user first connects to the Internet <b>30</b>, such as through a personal computer <b>32</b> which may be connected to the Internet <b>30</b> in any suitable manner, such as through its own portal or node or through some intermediate access provider. The personal computer <b>32</b> is not limited to a single computer but may instead comprise a network of computers, such as a local area network within an office.</p>\n  <p num=\"p-0067\">Once connected with the Internet <b>30</b>, at step <b>62</b>, the user accesses with a hyper-text browser the Universal Resource Locator (URL) associated with his or her MSDS <b>10</b> mailbox. The computer <b>32</b> may use any suitable hypertext browser, such as Netscape, to access the mailbox. A Hypertext Transfer Protocol Deamon (HTTPD) within the MSDS <b>10</b> receives the URL request at step <b>64</b> and, at step <b>66</b>, requests user authentication. The user then supplies his or her ID and password at step <b>68</b> and, if found valid at step <b>70</b>, the MSDS <b>10</b> provides the computer <b>32</b> with access to the mailbox at step <b>72</b>. If the ID and password are invalid, as determined at step <b>70</b>, then the HTTPD sends the computer <b>32</b> an authentication failure message at step <b>74</b>.</p>\n  <p num=\"p-0068\">After the user gains access to the mailbox at step <b>72</b>, the user can request information stored within the MSDS <b>10</b>. The MSDS <b>10</b> receives the request at step <b>76</b> and, at step <b>78</b>, determines whether the information exists. As is common practice, the MSDS <b>10</b> also determines the validity of the request at step <b>78</b>. The request from the user will include the mailbox number for the user, the message identifier, display preferences, and, if the message is a facsimile message, a page identifier. If for any reason the request is invalid, such as when a hacker is attempting to gain access to privileged information, the request for the information will be terminated.</p>\n  <p num=\"p-0069\">If the requested information is available, then at step <b>80</b> the information is transmitted through the Internet <b>30</b> to the user'\"'\"'s computer <b>32</b>. If, on the other hand, the information does not exist, then at step <b>82</b> the MSDS <b>10</b> will generate the requested information and then send the information to the user'\"'\"'s computer through the Internet <b>30</b> at step <b>80</b>.</p>\n  <p num=\"p-0070\">Prior to gaining access to the mailbox at step <b>72</b>, the user is preferably sent a greeting page or other such type of information which permits the user to learn about the services provided by the MSDS <b>10</b>, open an account with the MSDS <b>10</b>, or gain access to an account. Once access is provided at step <b>72</b>, the user is provided with information indicating the total number of messages stored in his or her mailbox within the MSDS <b>10</b>. Preferably, the information sent by the MSDS <b>10</b> indicates the total number of messages for each type of message and also the total number of saved messages versus the total number of new messages.</p>\n  <p num=\"p-0071\">The user is also preferably given the option at this step to change account information. The account information might include the E-mail address for the user, the manner in which messages are to be reviewed, the user'\"'\"'s pager information, as well as other user preferences. The display options and other user preferences will be discussed in further detail below.</p>\n  <p num=\"p-0072\">The general information HTML file which indicates the total number of different messages is provided with a number of anchors, which are also termed links or references. In general, an anchor permits a user on the computer <b>32</b> to retrieve information located on another file. For instance, an anchor to a listing of facsimile messages is preferably provided on the display of the total number of messages. When the user selects the anchor for the facsimile list, the MSDS <b>10</b> pulls up and displays the file containing the list of facsimiles, such as a file &#x201C;faxlist.html.&#x201D; The other types of messages, such as voice messages and data messages, would have similar anchors on the general information page directed to their respective HTML listing files.</p>\n  <p num=\"p-0073\">When a new message is received at step <b>54</b> in <figref idrefs=\"DRAWINGS\">FIG. 2</figref>, the user'\"'\"'s mailbox is updated to display the total number and types of messages. The MSDS <b>10</b> might also update other files in addition to the total listing of messages. Additionally, at this time, the MSDS <b>10</b> sends an E-mail message to the user'\"'\"'s computer <b>32</b> to inform the user of the newly arrived message. The MSDS <b>10</b> could also send notice to the user through a paging system so that the user receives almost instantaneous notice that a message is received.</p>\n  <p num=\"p-0074\">The MSDS <b>10</b> also generates additional information according to the user'\"'\"'s preferences. These preferences on how the MSDS <b>10</b> is configured for the user include options on how the messages are reviewed. With facsimile messages, for instance, the user can vary the amount or the type of information that will be supplied with the listing of the facsimile messages by selecting an appropriate option. Other options are also available so that the user can custom fit the MSDS <b>10</b> to the user'\"'\"'s own computer <b>32</b> or own personal preferences.</p>\n  <p num=\"p-0075\">For instance, when a facsimile message is received, the MSDS <b>10</b>, at step <b>54</b>, will update the total listing of all messages to indicate the newly received message and may additionally generate the HTML files for the newly received facsimile message according to the user'\"'\"'s preferences. When the user later requests information on the message at step <b>76</b>, the HTML information has already been generated and the MSDS <b>10</b> may directly send the requested information to the user at step <b>80</b>. If, on the other hand, the user desires to view the message according to one of the other options, the MSDS <b>10</b> wilt generate the HTML files at step <b>82</b> according to that other option at the time of the request.</p>\n  <p num=\"p-0076\">A first option available to the user for viewing a facsimile message is a textual only listing of the messages. The information on the textual listing preferably includes the date and time that the message was received at the MSDS <b>10</b>, the telephone number from where the message was transmitted, the number of pages, the page size, and the size of the message in bytes. The messages, of course, could be listed with other types of information. When the user selects one of the facsimile messages on the list, a request is sent to the HTTPD within the MSDS <b>10</b> causing the message to be downloaded via the Internet <b>30</b> to the user'\"'\"'s computer <b>32</b>. Once the message is received by the computer <b>32</b>, the message can be displayed, printed, or saved for further review.</p>\n  <p num=\"p-0077\">The second through fifth options allow the user to preview an image of the facsimile message before having the message downloaded from the MSDS <b>10</b> through the Internet <b>30</b> and to the computer <b>32</b>. The second option permits the user to view the list of messages with a reduced size image of the cover page next to each entry on the list. When the user selects one of the messages on the list, the selected facsimile message is transmitted through the Internet <b>30</b> to the computer <b>32</b>. The user may also scroll through the listings if all of the message cannot be displayed at one time on the computer <b>32</b>.</p>\n  <p num=\"p-0078\">The third option provides the user with a full size view of the cover page of each facsimile message. The user can quickly scroll through the cover pages of each message without downloading the entire message to the computer <b>32</b>. The full size view of the cover pages permit the user to clearly discern any comments that may be placed on the cover page, which may not be possible from just a reduced image of the cover page available through the second option.</p>\n  <p num=\"p-0079\">The fourth option provides the user with a reduced size image of each page and permits the user to scroll through the entire message. The user can therefore read the entire facsimile message on screen before the message is downloaded onto the computer <b>32</b>. With this option, the user can go through the pages of the facsimile message and can also skip to the next message or previous message. Additionally, the user has the option of enlarging a page to a full size view of the page. When one of the messages is selected, as with the other options, the HTTPD within the MSDS <b>10</b> causes the facsimile message to be transmitted through the Internet <b>30</b> to the user'\"'\"'s computer <b>32</b>.</p>\n  <p num=\"p-0080\">With a fifth option, a full size image of each page is transmitted to the users computer <b>32</b>. The user can scroll through the pages of the facsimile message and easily read the contents of each page. If the user wants the message downloaded to the computer <b>32</b>, the user selects the message and the HTTPD within the MSDS <b>10</b> transmits the message to the user'\"'\"'s computer <b>32</b> through the Internet <b>30</b>.</p>\n  <p num=\"p-0081\">As discussed above, after the database is updated at step <b>54</b>, the MSDS <b>10</b> will generate additional information based upon the option selected for displaying the facsimile messages. More specifically, as shown in <figref idrefs=\"DRAWINGS\">FIG. 4(A)</figref>, if the first option has been selected, as determined at step <b>100</b>, then at step <b>102</b> the MSDS <b>10</b> will generate the textual listing of the facsimile messages with anchors or references to the respective facsimile files. The HTML files are then moved to an Internet Server at step <b>104</b>.</p>\n  <p num=\"p-0082\">If the first option is not selected, the MSDS <b>10</b> next determines whether the second option has been selected at step <b>106</b>. With the second option, the facsimile messages are listed along with a reduced size image of the cover page. To generate this information, the cover page is extracted from the facsimile file at step <b>108</b> and a reduced size HTML image of the cover page is created at step <b>110</b>. At step <b>112</b>, a listing of the facsimile messages is generated with a thumbnail view of each cover page linked to its respective facsimile file. The generated HTML files are then sent to the Internet Server at step <b>104</b>.</p>\n  <p num=\"p-0083\">When the third option is selected, as determined at step <b>114</b>, a full size image of the cover page is sent to the computer <b>32</b>. The full size image of the cover page is generated by first extracting the cover page from the facsimile file at step <b>116</b>. Next, the cover page is converted into a full size HTML image at step <b>118</b> and, at step <b>120</b>, the listing is generated with the embedded cover page linked to the facsimile file.</p>\n  <p num=\"p-0084\">If, at step <b>122</b>, the fourth option is determined to be selected, then a reduced size image of each page is provided to the user with the option of enlarging the page to view the contents of the page more clearly. With reference to <figref idrefs=\"DRAWINGS\">FIG. 4(B)</figref>, the information necessary for the third option is produced by first extracting the first page of the facsimile message at step <b>124</b>. A reduced size HTML image is created at step <b>126</b> and then a full size HTML image is created at step <b>128</b>. At step <b>130</b>, the listing is generated with embedded thumbnail images of the pages with links to the full size images. If the page is not the last page, as determined at step <b>140</b>, then the next page is extracted at step <b>142</b> and steps <b>126</b> to <b>130</b> are repeated to generate the HTML files for the other pages of the facsimile message. After the last page has been converted into an HTML file according to the third option, the files are moved onto the Internet Server at step <b>104</b>.</p>\n  <p num=\"p-0085\">At step <b>144</b>, the MSDS <b>10</b> determines whether the fifth option has been selected. The fifth option provides the user with a full size image of each page of the facsimile message. While only five options have been discussed, the invention may be practiced with additional options. Consequently, with additional options and with the fourth option not being selected, the MSDS <b>10</b> would next determine whether one of the additional options have been selected. With the preferred embodiment of the invention having only five options, however, the MSDS <b>10</b> will assume that the fifth option has been selected if none of the first four options were found to be selected.</p>\n  <p num=\"p-0086\">The information necessary to display the pages of the facsimile message according to the fifth option is generated by first extracting the first page of the facsimile message at step <b>146</b>. At step <b>148</b>, a full size HTML image of the page is created and, at step <b>150</b>, a listing is generated with an embedded image and links to previous and next pages. When the page is not the last page, as determined at step <b>152</b>, the MSDS <b>10</b> extracts the next page and generates the HTML file for that page. After all pages have been converted into HTML files according to the fourth option, the files are sent to the Internet Server at step <b>104</b>.</p>\n  <p num=\"p-0087\">While <figref idrefs=\"DRAWINGS\">FIGS. 4(A)</figref> and (B) describe the operations of the MSDS <b>10</b> at the time a message is received, <figref idrefs=\"DRAWINGS\">FIG. 5</figref> depicts an overall flowchart of operations for the MSDS <b>10</b> when the user requests a page of information in a display format other than the user'\"'\"'s preferred option of displaying the message. <figref idrefs=\"DRAWINGS\">FIG. 5</figref> is therefore a more detailed explanation of how the MSDS <b>10</b> generates the necessary information at step <b>82</b> of <figref idrefs=\"DRAWINGS\">FIG. 3</figref>.</p>\n  <p num=\"p-0088\">In general, as shown in <figref idrefs=\"DRAWINGS\">FIG. 5</figref>, the MSDS <b>10</b> first determines the type of image that is needed at step <b>82</b><i>a</i>. For example, at this step, the MSDS <b>10</b> will determine whether images are unnecessary, whether an image of just the cover page is necessary, whether an image is needed for every page, and whether the image needs to be a full size, a reduced size, or both full and reduced sized images. At step <b>82</b><i>b</i>, the MSDS <b>10</b> determines whether the image has already been created. If the image has not been created, then at step <b>82</b><i>c </i>the MSDS <b>10</b> will extract the page from the base facsimile file and, at step <b>82</b><i>d</i>, generate the required HTML image. As discussed above, the required image may be for just the cover page, for all the pages, and may be a full size and/or a reduced size image of the page. At step <b>82</b><i>e</i>, the image is embedded with links or anchors to other HTML files. These links or anchors might be references to the next and previous pages and also to the next and previous facsimile messages. Finally, the HTML file having the embedded image and links is sent to the user at step <b>80</b> in <figref idrefs=\"DRAWINGS\">FIG. 3</figref>.</p>\n  <p num=\"p-0089\">The process for converting a facsimile message into HTML files according to the fifth option will be described with reference to <figref idrefs=\"DRAWINGS\">FIG. 6</figref>. This process will occur at step <b>54</b> when the message is received and when the fifth option is the user'\"'\"'s preferred option of displaying the messages. It should be understood that a similar type of process will also occur when the user requests a page of information according to the fifth option when the user is retrieving a facsimile message and the fifth option is not the user'\"'\"'s preferred option. The conversion processes according to the other options will become apparent to those skilled in the art and will therefore not be discussed in further detail.</p>\n  <p num=\"p-0090\">With reference to <figref idrefs=\"DRAWINGS\">FIG. 6</figref>, when the facsimile message is received, the message is in a Tagged Image File Format/Facsimile (TIFF/F) and each page of the facsimile message is split into a separate file. Each page of the facsimile message is then converted from the TIFF/F format into a Portable Pixel Map (PPM) format. The PPM files are next converted into separate Graphic Interchange Format (GIF) files and then into separate HTML files. Thus, each page of the facsimile message is converted into a separate HTML file. The TIFF/F files may be converted into PPM with an available software package entitled &#x201C;LIBTIFF&#x201D; and the PPM files may be converted into GIF files with an available software package found in &#x201C;Portable Pixel Map Tools.&#x201D;</p>\n  <p num=\"p-0091\">The invention is not limited to this exact conversion process or to the particular software packages used in the conversion process. For instance, the TIFF/F files may be converted into another portable file format, through any other type of intermediate format, or may be converted directly into the GIF format. Further, instead of GIF, the facsimile messages may be converted into JPEG, BMP, PCx, PIF, PNG, or any other suitable type of file format.</p>\n  <p num=\"p-0092\">The files may be identified with any suitable filename. In the preferred embodiment, the files for each user are stored in a separate directory assigned to just that one user because an entire directory for a given user generally can be protected easier than the individual files. The memory, however, may be organized in other ways with the files for a single user being stored in different directories. The first part of the filename is a number preferably sequentially determined according to the order in which messages arrive for that user. The preferred naming convention for ending the filenames is depicted in <figref idrefs=\"DRAWINGS\">FIG. 6</figref>. Each page of the facsimile message is saved as a separate file with an extension defined by the format of the file. Thus, the files will end with an extension of &#x201C;.TIFF,&#x201D; &#x201C;.PPM,&#x201D; &#x201C;.GIF,&#x201D; or &#x201C;.HTML&#x201D; according to the format of the particular file. In the example shown, the separate pages have filenames which end with the respective page number, for instance, the first page ends with a &#x201C;1.&#x201D; The files, however, are preferably terminated with a letter or multiples letters to indicate the order of the pages. For instance, page 1 might have an ending of &#x201C;aa,&#x201D; page 2 might have an ending of &#x201C;ab,&#x201D; etc. The invention, however, is not limited to the disclosed naming convention but encompasses other conventions that will be apparent to those skilled in the art.</p>\n  <p num=\"p-0093\">As shown in <figref idrefs=\"DRAWINGS\">FIG. 6</figref>, in addition to the GIF files representing the pages of the facsimile message, the HTML files include a number of anchors or references. In the example shown, the first HTML file has an anchor a for the &#x201C;Next Page.&#x201D; Anchor a is defined as a=&lt;A HREF=&#x201C;2.html&#x201D;&gt; Next Page &lt;/a&gt; and will therefore reference the second HTML file when a user selects the &#x201C;Next Page.&#x201D; The second HTML file has an anchor b for the &#x201C;Previous Page&#x201D; and an anchor c for the &#x201C;Next Page&#x201D; and the third HTML file has an anchor d for the &#x201C;Previous Page.&#x201D; With these particular HTML files, the user can scroll through each page of the facsimile message and view a full size image of the page.</p>\n  <p num=\"p-0094\">Each HTML file preferably contains anchors in addition to those relating to &#x201C;Next Page&#x201D; and &#x201C;Previous Page.&#x201D; For instance, each HTML file may contain an anchor to the next facsimile message, an anchor to the previous facsimile message, and an anchor to return to the facsimile list. The HTML files preferably contain anchors relating to &#x201C;Save&#x201D; and &#x201C;Delete.&#x201D; When the &#x201C;Save&#x201D; anchor is selected, the user would be able to save the message under a more descriptive name for the message. The &#x201C;Delete&#x201D; anchor is preferably followed by a inquiry as to whether the user is certain that he or she wants to delete the message. Other anchors, such as an anchor to the general listing, will be apparent to those skilled in the art and may also be provided.</p>\n  <p num=\"p-0095\"><figref idrefs=\"DRAWINGS\">FIG. 7</figref> provides an example of a display according to the fifth option for the first page of the facsimile message shown in <figref idrefs=\"DRAWINGS\">FIG. 6</figref>. The headings of the display provide information on the telephone number from where the message was sent, the date and time the message was received at the MSDS <b>10</b>, and an indication of the page of the message being displayed. The main portion of the display is the full size image of the page. At the bottom of the display, an anchor or link is provided to the &#x201C;Next Page&#x201D; and another anchor is provided to the &#x201C;Return to Fax Listing.&#x201D; Additional information may also be provided on the display, such as a link to a company operating the MSDS <b>10</b>.</p>\n  <p num=\"p-0096\">An example of the &#x201C;1.html&#x201D; file for generating the display shown in <figref idrefs=\"DRAWINGS\">FIG. 7</figref> is shown below in Table 1.</p>\n  <p num=\"p-0097\"><tables id=\"TABLE-US-00001\" num=\"00001\"><table frame=\"none\" colsep=\"0\" rowsep=\"0\"><tgroup align=\"left\" colsep=\"0\" rowsep=\"0\" cols=\"1\"><colspec colname=\"1\" colwidth=\"217pt\" align=\"left\"/><thead><row><entry namest=\"1\" nameend=\"1\" rowsep=\"1\">TABLE 1</entry></row><row><entry namest=\"1\" nameend=\"1\" align=\"center\" rowsep=\"1\"/></row></thead><tbody valign=\"top\"><row><entry>&lt;HTML&gt;</entry></row><row><entry>&lt;HEAD&gt;</entry></row><row><entry>&lt;TITLE&gt;Fax Received on May 31, 1995 at 1:58 PM from (404) 249 6801;</entry></row><row><entry>Page 1 of 3&lt;/TITLE&gt;</entry></row><row><entry>&lt;/HEAD&gt;</entry></row><row><entry>&lt;BODY&gt;</entry></row><row><entry>&lt;H1&gt;Fax from (404) 249-6801&lt;/H1&gt;</entry></row><row><entry>&lt;H2&gt;Received on May 31, 1995 at 1:58 PM&lt;/H2&gt;</entry></row><row><entry>&lt;H2&gt;Page 1 of 3&lt;/H2&gt;</entry></row><row><entry>&lt;IMG SRC=&#x201C;1.gif&#x201D;&gt;</entry></row><row><entry>&lt;P&gt;</entry></row><row><entry>&lt;A HREF=&#x201C;2.html&#x201D;&gt;Next Page&lt;/a&gt;</entry></row><row><entry>&lt;HR&gt;</entry></row><row><entry>&lt;A HREF=&#x201C;faxlist.html&#x201D;&gt;Return to Fax Listing&lt;/A&gt;</entry></row><row><entry>&lt;P&gt;</entry></row><row><entry>This page was automatically generated by FaxWeb(tm) on May 31, 1995</entry></row><row><entry>at 2:05 PM.</entry></row><row><entry>&lt;P&gt;</entry></row><row><entry>&amp;copy; 1995 NetOffice, Inc.</entry></row><row><entry>&lt;HR&gt;</entry></row><row><entry>&lt;Address&gt;</entry></row><row><entry>&lt;A HREF=&#x201C;http://www.netoffice.com/&#x201D;&gt;NetOffice, Inc.&lt;/A&gt;&lt;BR&gt;</entry></row><row><entry>PO Box 7115&lt;BR&gt;</entry></row><row><entry>Atlanta, GA 30357&lt;BR&gt;</entry></row><row><entry>&lt;A HREF=&#x201C;mailto:info@netoffice.com&#x201D;&gt;info@netoffice.com&lt;/A&gt;</entry></row><row><entry>&lt;/Address&gt;</entry></row><row><entry>&lt;/BODY&gt;</entry></row><row><entry>&lt;/HTML&gt;</entry></row><row><entry namest=\"1\" nameend=\"1\" align=\"center\" rowsep=\"1\"/></row></tbody></tgroup></table></tables><br/>As is apparent from the listing in Table 1, the image file &#x201C;1.gif&#x201D; for the first page is embedded into the HTML file &#x201C;1.html.&#x201D; Also apparent from the listing is that the anchor for &#x201C;Next Page&#x201D; directs the MSDS <b>10</b> to the second page of the facsimile message having the filename &#x201C;2.html&#x201D; and the anchor for &#x201C;Return to Fax Listing&#x201D; directs the MSDS <b>10</b> to the filename &#x201C;faxlist.html&#x201D; containing the list of facsimile messages.</p>\n  <p num=\"p-0098\">A process for converting a voice message into an HTML file is illustrated in <figref idrefs=\"DRAWINGS\">FIG. 8</figref>. The voice message is originally stored in a VOX format or an AD/PCM format and is retrieved at step <b>170</b>. The voice message is then converted either into an AU format or WAV format in accordance with the user'\"'\"'s preference, which is stored in memory. Preferably, the message is preferably in the AD/PCM format originally and is converted in WAV, but the voice files may alternatively be stored and converted in file formats other than the ones disclosed, such as RealAudio (RA).</p>\n  <p num=\"p-0099\">At step <b>174</b>, the listing of all of the voice messages is then updated to include a listing of the newly received voice message and an anchor to the voice message. For instance, the original voice message may be stored with filename &#x201C;1.vox&#x201D; and is converted into WAV and stored with a filename &#x201C;1.wav.&#x201D; The HTML file &#x201C;voicelist.html&#x201D; which contains a list of all voice messages would then have an anchor to the filename &#x201C;1.wav&#x201D; along with identifying information for the voice message, such as when the message was received.</p>\n  <p num=\"p-0100\">The listing of the voice messages may have additional anchors or references. For instance, each voice message may have an anchor directing the MSDS <b>10</b> to a file which contains a short sampling of the message. Thus, when the user selects this anchor, the user could receive the first 5 seconds of the message or some other predefined number of seconds. As with the listing of facsimile messages, the listing of the voice messages also preferably has anchors to &#x201C;Save&#x201D; and &#x201C;Delete.&#x201D;</p>\n  <p num=\"p-0101\"><figref idrefs=\"DRAWINGS\">FIG. 9</figref> illustrates a process for converting a data message into HTML. At step <b>180</b>, the data file is retrieved from a database and at step <b>182</b> the HTML file containing the list of data messages is updated to include a listing of the newly received message along with identifying information. For instance, the HTML file for the listing &#x201C;datalist.html&#x201D; would be updated to include an anchor to a data file &#x201C;file1.1&#x201D; and would have information such as the time and date that the data was transmitted, the size of the data file, as well as additional identifying information.</p>\n  <p num=\"p-0102\">Because the MSDS <b>10</b> can receive messages of various types, such as a facsimile message, voice message or data message, the MSDS <b>10</b> must be able to determine the type of message that is being sent over the DID trunk <b>15</b>. With reference to <figref idrefs=\"DRAWINGS\">FIG. 10</figref>, when an incoming call is received, the MSDS <b>10</b> goes off hook at step <b>200</b> and starts to generate a ringing sound. If, at step <b>202</b>, a facsimile calling tone is detected, then the ringing sound is stopped at step <b>204</b> and the message is received as a facsimile message at step <b>206</b>. Similarly, when a data modem calling tone is detected at step <b>208</b>, the ringing sound is stopped at step <b>210</b> and the message is identified as a data message at step <b>212</b>.</p>\n  <p num=\"p-0103\">If the MSDS <b>10</b> detects a DTMF digit at step <b>214</b>, the ringing sound is stopped at step <b>216</b> and the MSDS <b>10</b> then determines which digit was pressed. When the digit is a &#x201C;1,&#x201D; as determined at step <b>218</b>, the message is identified as a facsimile message. The MSDS <b>10</b> will thereafter receive and store the facsimile message in the manner described above with reference to <figref idrefs=\"DRAWINGS\">FIG. 2</figref>. If the digit is identified as a &#x201C;0&#x201D; at step <b>220</b>, the call is identified as an owner'\"'\"'s call and will be processed in a manner that will be described below with reference to <figref idrefs=\"DRAWINGS\">FIG. 12</figref>. As will be apparent, other digits may cause the MSDS <b>10</b> to take additional steps. If any other DTMF digit is pressed, at step <b>224</b> the MSDS <b>10</b> activates a voice call system, which will be described in more detail below with reference to <figref idrefs=\"DRAWINGS\">FIG. 11</figref>.</p>\n  <p num=\"p-0104\">With step <b>226</b>, the MSDS <b>10</b> will enter a loop continuously checking for a facsimile calling tone, a data modem calling tone, or for a DTMF digit. If after n rings none of these tones or digits has been detected, the ringing sound is stopped at step <b>228</b> and the voice call system is activated at step <b>224</b>.</p>\n  <p num=\"p-0105\">With reference to <figref idrefs=\"DRAWINGS\">FIG. 11</figref>, when a fax calling tone or modem calling tone is not detected, the voice call system begins at step <b>230</b> by playing a voice greeting. If the greeting was not interrupted by a DTMF digit as determined at step <b>232</b>, then the caller is prompted for the voice message at step <b>234</b> and, at step <b>236</b>, the voice message is recorded and stored in memory. At step <b>238</b>, the caller is prompted with a number of options, such as listening to the message, saving the message, or re-recording the message. Since the selection of these options with DTMF digits will be apparent to those skilled in the art, the details of this subroutine or subroutines will not be described in further detail. When the caller wishes to re-record the message, as determined at step <b>240</b>, the caller is again prompted for a message at step <b>234</b>. If the caller does not wish to re-record the message, the call is terminated at step <b>242</b>.</p>\n  <p num=\"p-0106\">If the voice greeting is interrupted by a DTMF digit, as determined at step <b>232</b>, then the MSDS <b>10</b> ascertains which digit has been pressed. At step <b>244</b>, if the digit is a &#x201C;0,&#x201D; the MSDS <b>10</b> detects that the call is an owner'\"'\"'s call. When the digit is a &#x201C;1,&#x201D; the MSDS <b>10</b> is informed at step <b>206</b> that the call carries a facsimile message. As discussed above with reference to <figref idrefs=\"DRAWINGS\">FIG. 10</figref>, other DTMF digits may cause the MSDS <b>10</b> to take additional steps. If an invalid digit is pressed, by default at step <b>248</b> the routine returns to step <b>234</b> of prompting the caller for a message.</p>\n  <p num=\"p-0107\">It should be understood that the invention is not limited to the specific interactive voice response system described with reference to <figref idrefs=\"DRAWINGS\">FIG. 11</figref>. As discussed above, the invention may be responsive to DTMF digits other than just a &#x201C;0&#x201D; and a &#x201C;1.&#x201D; Further variations or alterations will be apparent to those skilled in the art.</p>\n  <p num=\"p-0108\">With reference to <figref idrefs=\"DRAWINGS\">FIG. 12</figref>, when the call is considered an owners call, the caller is first prompted for the password at step <b>250</b>. The password is received at step <b>252</b> and, if found correct at step <b>254</b>, a set of announcements are played to the owner. These announcements would preferably inform the owner of the number of new messages that have been received, the number of saved messages, the number of facsimile message, the number of data messages, and the number of voice messages. Other announcements, of course, could also be made at this time.</p>\n  <p num=\"p-0109\">At step <b>258</b>, the owner then receives a recording of the owner'\"'\"'s menu with the appropriate DTMF digit for each option. For instance, the DTMF digit &#x201C;1&#x201D; may be associated with playing a message, the DTMF digit &#x201C;2&#x201D; may be associated with an options menu, and the DTMF digit &#x201C;*&#x201D; may be associated with returning to a previous menu or terminating the call if no previous menu exists.</p>\n  <p num=\"p-0110\">A DTMF digit is detected at step <b>260</b> and the appropriate action is taken based upon the digit received. Thus, if the digit is determined to be a &#x201C;1&#x201D; at step <b>264</b>, the owner can play a message at step <b>266</b>. At step <b>266</b>, the owner is preferably greeted with a menu giving the owner the options of playing or downloading new messages, saved messages, facsimile messages, data messages, or voice messages. As should be apparent to those skilled in the art, the owner may receive one or more menus at step <b>266</b> and the owner may enter one or more DTMF digits in order to play or download a particular message.</p>\n  <p num=\"p-0111\">If, instead, the digit is determined to be a &#x201C;2&#x201D; at step <b>268</b>, then the owner receives an options menu at step <b>270</b>. With the options menu, the owner can enter or change certain parameters of the MSDS <b>10</b>. For instance, the owner can change his or her password, the owner can change the manner in which facsimile messages are displayed on the computer <b>32</b>, the owner can change the image file format from GIF to another format, the owner can select the file formats for the voice messages, as well as other options.</p>\n  <p num=\"p-0112\">If the &#x201C;*&#x201D; DTMF digit is received, as determined at step <b>272</b>, then the owner is returned to a previous menu. The &#x201C;*&#x201D; digit is also used to terminate the call when the owner has returned to the initial menu. The &#x201C;*&#x201D; digit is therefore universally recognized by the MSDS <b>10</b> throughout the various menus as a command for returning to a previous menu.</p>\n  <p num=\"p-0113\">If the owner enters a DTMF digit that is not being used by the MSDS <b>10</b>, the owner receives an indication at step <b>276</b> that the key is invalid and the owner is then again provided with the owner'\"'\"'s menu at step <b>258</b>. When the owner does not enter a DTMF digit while the owner'\"'\"'s menu is being played, as determined at step <b>260</b>, the menu will be replayed n times. Once the menu has been replayed n times, as determined at step <b>262</b>, then the call will be terminated at step <b>278</b>.</p>\n  <p num=\"p-0114\">If the password is incorrect, as determined at step <b>254</b>, then the MSDS <b>10</b> checks whether the user has made more than &#x201C;n&#x201D; attempts at step <b>280</b>. If &#x201C;n&#x201D; attempts have not been made, then a password incorrect message will be displayed to the user at step <b>282</b> and the user will once again be prompted for the password at step <b>250</b>. When the user has made &#x201C;n&#x201D; attempts to enter the correct password, the MSDS <b>10</b> will play a failure message to the user at step <b>284</b> and then terminate the call at step <b>286</b>. The specific number &#x201C;n&#x201D; may be three so that the call is terminated after three failed attempts.</p>\n  <p num=\"p-0115\">The owner'\"'\"'s menu may be responsive to an additional number of DTMF digits and may be structured in other ways. For instance, separate DTMF digits may direct the owner to the respective types of messages, such as a facsimile message, data message, or voice message. Also, separate DTMF digits may direct the owner to a recording of new messages or to a recording of saved messages. Other variations will be apparent to those skilled in the art.</p>\n  <p num=\"p-0116\">A more detailed diagram of the MSDS <b>10</b> is shown in <figref idrefs=\"DRAWINGS\">FIG. 13</figref>. As shown in the figure, a plurality of DID trunks <b>15</b> are received by an input/output device <b>17</b> and are then sent to a central processor <b>3</b>. The number of DID trunks <b>15</b> may be changed to any suitable number that would be necessary to accommodate the anticipated number of telephone calls that may be made to the MSDS <b>10</b>. The input/output device <b>17</b> routes a call on one of the DID trunks <b>15</b> to an open port of the central processor <b>3</b> and is preferably a DID Interface Box manufactured by Exacom.</p>\n  <p num=\"p-0117\">The central processor <b>3</b> receives the calls on the DID trunks <b>15</b> and stores the messages in storage <b>11</b> in accordance with software <b>7</b>. Preferably, a separate directory in storage <b>11</b> is established for each user having an account on the MSDS <b>10</b> so that all of the messages for a single user will be stored in the same directory. It should be understood that the number of processors within the central processor <b>3</b> is dependent upon the number of DID trunks <b>15</b>. With a greater number of DID trunks <b>15</b> capable of handling a larger number of telephone calls, the central processor <b>3</b> may actually comprise a number of computers. The input/output device <b>17</b> would then function to route incoming calls to an available computer within the central processor <b>3</b>.</p>\n  <p num=\"p-0118\">A more detailed diagram of the central processor <b>3</b> is shown in <figref idrefs=\"DRAWINGS\">FIG. 14</figref>. The central processor <b>3</b> comprises a telephone line interface <b>21</b> for each DID trunk <b>15</b>. The telephone interface <b>21</b> provides the ringing sounds and other communication interfacing with the telephone lines. The signals from the telephone interface <b>21</b> are routed to a pulse/tone decoder <b>23</b> and to a digital signal processor (DSP) <b>25</b>. The pulse/tone decoder <b>23</b> detects the address signal off of an incoming call and sends the address signal onto a bus <b>29</b> to a microprocessor <b>27</b>. The DSP performs the necessary signal processing on the incoming calls and routes the processed signals to the microprocessor <b>27</b>.</p>\n  <p num=\"p-0119\">The microprocessor <b>27</b> will then read the address signal from the pulse/tone decoder <b>23</b> and store the message from the DSP <b>25</b> in an appropriate directory in storage <b>11</b>. As discussed above, the central processor <b>3</b> may comprise a number of computers or, more precisely, a number of microprocessors <b>27</b> with each microprocessor <b>27</b> handling the calls from a certain number, such as four, DID trunks <b>15</b>. The microprocessor <b>27</b> may comprise any suitable microprocessor, but is preferably at least a 486 PC.</p>\n  <p num=\"p-0120\">In addition to handling incoming calls and storing the messages in storage <b>11</b>, the central processor <b>3</b> also coordinates the interactive voice response system of the MSDS <b>10</b>. The software <b>7</b> would incorporate the flowcharts of operations for receiving a message shown in <figref idrefs=\"DRAWINGS\">FIG. 3</figref>, for detecting the type of message on an incoming call shown in <figref idrefs=\"DRAWINGS\">FIG. 10</figref>, for receiving voice messages shown in <figref idrefs=\"DRAWINGS\">FIG. 11</figref>, and for receiving an owner'\"'\"'s call shown in <figref idrefs=\"DRAWINGS\">FIG. 12</figref>. Based upon the above-referenced flowcharts and the respective descriptions, the production of the software <b>7</b> is within the capability of one of ordinary skill in the art and will not be described in any further detail.</p>\n  <p num=\"p-0121\">The Internet Server <b>5</b> is connected to the central processor <b>3</b>, such as through a local area network, and also has access to the storage <b>11</b>. The Internet Server <b>5</b> performs a number of functions according to software <b>9</b>. For instance, the Internet Server <b>5</b> retrieves the data files stored in storage <b>11</b> by the central computer <b>3</b> and converts the files into the appropriate HTML files. The converted HTML files are then stored in storage <b>11</b> and may be downloaded to the computer <b>32</b> through the Internet <b>30</b>. The Internet Server <b>5</b> also handles the requests from the computer <b>32</b>, which might require the retrieval of files from the storage <b>11</b> and possibly the generation of additional HTML files.</p>\n  <p num=\"p-0122\">The software <b>9</b> for the Internet Server <b>5</b> would therefore incorporate the flowchart of operations for generating HTML files according to user preferences shown in <figref idrefs=\"DRAWINGS\">FIG. 4</figref>, for generating requested information from a user shown in <figref idrefs=\"DRAWINGS\">FIG. 5</figref>, for converting facsimile messages into HTML shown in <figref idrefs=\"DRAWINGS\">FIG. 6</figref>, for converting voice messages into HTML shown in <figref idrefs=\"DRAWINGS\">FIG. 8</figref>, and for converting data messages into HTML shown in <figref idrefs=\"DRAWINGS\">FIG. 9</figref>. Based upon the above-referenced flowcharts and their respective descriptions, the production of the software <b>9</b> is within the capability of one of ordinary skill in the art and need not be described in any further detail.</p>\n  <p num=\"p-0123\">Nonetheless, a more detailed block diagram of the Internet Server <b>5</b> is shown in <figref idrefs=\"DRAWINGS\">FIG. 15</figref>. The Internet Server <b>5</b> runs on a suitable operating system (OS) <b>39</b>, which is preferably Windows NT. The Internet Server <b>5</b> has a number of application programs <b>31</b>, such as the ones depicted in the flowcharts discussed above, for communicating with the central processor <b>3</b> and for accessing data from storage <b>11</b> and also from memory <b>33</b>.</p>\n  <p num=\"p-0124\">The memory <b>33</b>, inter alia, would contain the data indicating the preferences of each user. Thus, for example, when a facsimile message in the TIFF/F format is retrieved by the Internet Server <b>5</b>, the Internet Server <b>5</b> would ascertain from the data in memory <b>33</b> the preferred option of displaying the facsimile message and would generate the appropriate HTML files.</p>\n  <p num=\"p-0125\">All interfacing with the Internet <b>30</b> is handled by the HTTPD <b>37</b>, which, in the preferred embodiment, is &#x201C;Enterprise Server&#x201D; from NetScape Communications Corp. Any requests from users, such as a request for a file, would be handled by the HTTPD <b>37</b>, transferred through the CGI <b>35</b>, and then received by the application programs <b>31</b>. The application programs <b>31</b> would then take appropriate actions according to the request, such as transferring the requested file through the CGI <b>35</b> to the HTTPD <b>37</b> and then through the Internet <b>30</b> to the user'\"'\"'s computer <b>32</b>.</p>\n  <p num=\"p-0126\">The Internet Server <b>5</b> may be connected to a paging system <b>13</b>. Upon the arrival of a new message, in addition to sending an E-mail message to the user'\"'\"'s mailbox, the Internet Server <b>13</b> may also activate the paging system <b>13</b> so that a pager <b>15</b> would be activated. In this manner, the user could receive almost instantaneous notification that a message has arrived.</p>\n  <p num=\"p-0127\">The paging system <b>13</b> is preferably one that transmits alphanumeric characters so that a message may be relayed to the user'\"'\"'s pager <b>15</b>. The Internet Server <b>5</b> therefore comprises a signal processor <b>41</b> for generating signals recognized by the paging system <b>13</b> and a telephone interface <b>43</b>. The signal processor <b>41</b> preferably receives information from the application programs <b>31</b> and generates a paging message in a paging file format, such as XIO/TAP. The telephone interface <b>43</b> would include a modem, an automatic dialer, and other suitable components for communicating with the paging system <b>13</b>.</p>\n  <p num=\"p-0128\">The information from the application programs <b>31</b> may simply notify the user of a message or may provide more detailed information. For instance, with a facsimile message, the information from the application programs <b>31</b> may comprise CSI information identifying the sender'\"'\"'s telephone number. The user would therefore receive a message on the pager <b>15</b> informing the user that a facsimile message was received from a specified telephone number. The amount and type of information that may be sent to the user on the pager <b>15</b> may vary according to the capabilities of the paging system <b>13</b> and may provide a greater or lesser amount of information than the examples provided.</p>\n  <p num=\"p-0129\">The Internet Server <b>5</b> is not limited to the structure shown in <figref idrefs=\"DRAWINGS\">FIG. 15</figref> but may comprise additional components. For instance, the HTTPD <b>37</b> would be linked to the Internet <b>30</b> through some type of interface, such as a modem or router. The Internet Server <b>5</b> may be connected to the Internet <b>30</b> through typical phone lines, ISDN lines, a TI circuit, a T3 circuit, or in other ways with other technologies as will be apparent to those skilled in the art.</p>\n  <p num=\"p-0130\">Furthermore, the Internet Server <b>5</b> need not be connected to the Internet <b>30</b> but may be connected to other types of networks. For instance, the Internet Server <b>5</b>, or more generally the network Server <b>5</b>, could be connected to a large private network, such as one established for a large corporation. The network Server <b>5</b> would operate in the same manner by converting messages into HTML files, receiving requests for information from users on the network, and by transmitting the information to the users.</p>\n  <p num=\"p-0131\">Also, at least one interface circuit would be located between the Internet Server <b>5</b> and the central processor <b>3</b> in order to provide communication capabilities between the Internet Server <b>5</b> and the central processor <b>3</b>. This network interface may be provided within both the Internet Server <b>5</b> and the central processor <b>3</b> or within only one of the Internet Server <b>5</b> or central processor <b>3</b>.</p>\n  <p num=\"p-0132\">Examples of the Internet Server <b>5</b> software layers are shown in <figref idrefs=\"DRAWINGS\">FIGS. 16(A) and 16(B)</figref>, with <figref idrefs=\"DRAWINGS\">FIG. 16(A)</figref> representing the Internet Server <b>5</b> in an asynchronous mode of communication and <figref idrefs=\"DRAWINGS\">FIG. 16(B)</figref> representing the Internet <b>5</b> in a synchronous mode of communication. As shown in the figures, the software <b>9</b> for the Internet Server <b>5</b> may additional comprise an Internet Deamon for running the HTTPD <b>37</b>. The software <b>9</b> for the Internet Server <b>5</b> would also include TCP/IP or other transport layers. Moreover, while the authentication is provided through the HTTPD <b>37</b>, the authentication of the user'\"'\"'s password and ID may be supplemented or replaced with other ways of authentication.</p>\n  <p num=\"p-0133\">The term synchronous has been used to refer to a mode of operation for the MSDS <b>10</b> in which the all possible HTML files for a message are generated at the time the message is received. The HTML files may be generated by the central processor <b>3</b> or by the application programs <b>31</b>. When a request for information is then later received by the HTTPD <b>37</b>, the information has already been generated and the HTTPD <b>37</b> only needs to retrieve the information from storage <b>11</b> and transmit the information to the user'\"'\"'s computer <b>32</b>. With a synchronous mode of operation, the CGI <b>35</b> would be unnecessary.</p>\n  <p num=\"p-0134\">The MSDS <b>10</b> preferably operates according to an asynchronous mode of operation. In an asynchronous mode of operation, information requested by the user may not be available and may have to be generated after the request. The asynchronous mode of operation is preferred since fewer files are generated, thereby reducing the required amount of storage <b>11</b>. Because the information requested by a user may not be available, some anchors cannot specify the filename, such as &#x201C;2.html,&#x201D; but will instead contain a command for the file. For instance, an anchor may be defined as &lt;AHREF=&#x201C;/faxweb/users/2496801/S viewpage.cgi?FAX_NUM=1&amp;PAGE=1&amp;VIEW_MODE=FULL&#x201D;&gt; for causing the CGI <b>35</b> to run a viewpage program so that page 1 of facsimile message 1 will be displayed in a full size image. The CGI <b>35</b> will generate the requested information when the information has not been generated, otherwise the CGI <b>35</b> will retrieve the information and relay the information to the HTTPD <b>37</b> for transmission to the user.</p>\n  <p num=\"p-0135\">With the invention, the MSDS <b>10</b> can reliably receive voice, facsimile, and data messages for a plurality of users and can receive more than one message for a user at a single time. The messages are stored by the MSDS <b>10</b> and can be retrieved at the user'\"'\"'s convenience at any time by connecting to the Internet <b>30</b>. The Internet World Wide Web <b>30</b> is a constantly expanding network that permits the user to retrieve the messages at virtually any location in the world. Since the user only needs to incur a local charge for connecting to the Internet <b>30</b>, the user can retrieve or review messages at a relatively low cost.</p>\n  <p num=\"p-0136\">Even for the user'\"'\"'s at the office or at home, the MSDS <b>10</b> provides a great number of benefits. The user would not need a facsimile machine, voice mail system, or a machine dedicated for receiving data messages. The user also need not worry about losing part of the message or violating the confidential nature of the messages. The user, of course, can still have a facsimile machine and dedicated computer for data messages. The MSDS <b>10</b>, however, will permit the user to use the telephone company'\"'\"'s &#x201C;call forwarding&#x201D; feature so that messages may be transferred to the MSDS <b>10</b> at the user'\"'\"'s convenience, such as when the user is away from the office.</p>\n  <p num=\"p-0137\">The software <b>7</b> and software <b>9</b> are not limited to the exact forms of the flowcharts shown but may be varied to suit the particular hardware embodied by the invention. The software may comprise additional processes not shown or may combine one or more of the processes shown into a single process. Further, the software <b>7</b> and <b>9</b> may be executed by a single computer, such as a Silicon Graphics Workstation, or may be executed by a larger number of computers.</p>\n  <p num=\"p-0138\">The facsimile messages preferably undergo signal processing so that the images of the facsimile messages are converted from a two tone black or white image into an image with a varying gray scale. As is known in the art, a gray scale image of a facsimile message provides a better image than simply a black or white image of the message. The signal processing may comprise any suitable standard contrast curve method of processing, such as anti-aliasing or a smoothing filter. The signal processing may occur concurrently with the conversion from TIFF/F to GIF and is preferably performed for both full and reduced size images of the facsimile messages.</p>\n  <p num=\"p-0139\">Furthermore, the user may be provided with a greater or fewer number of options in displaying or retrieving messages. The options are not limited to the exact forms provided but may permit the user to review or retrieve the messages in other formats. The options may also permit a user to join two or messages into a single message, to delete portions of a message, or to otherwise the contents of the messages. Also, the various menus provided to the user over the telephone may have a greater number of options and the MSDS <b>10</b> may accept responses that involve more than just a single DTMF digit.</p>\n  <p num=\"p-0140\">The specific DTMF digits disclosed in the various menus are only examples and, as will be apparent to those skilled in the art, other digits may be used in their place. For instance, a &#x201C;9&#x201D; may be used in the place of a &#x201C;n&#x201D; in order to exit the menu or to return to a previous menu. Also, the DTMF digits may be changed in accordance with the user'\"'\"'s personal convention. If the user had a previous voice mail system, the user could customize the commands to correspond with the commands used in the previous system in order to provide a smooth transition to the MSDS <b>10</b>.</p>\n  <p num=\"p-0141\">The MSDS <b>10</b> may restrict a user to only certain types of messages. For instance, a user may want the MSDS <b>10</b> to store only facsimile messages in order to reduce costs of using the MSDS <b>10</b>. In such a situation, the MSDS <b>10</b> would perform an additional step of checking that the type of message received for a user is a type of message that the MSDS <b>10</b> is authorized to receive on the user'\"'\"'s behalf. When the message is an unauthorized type of message, the MSDS <b>10</b> may ignore the message entirely or the MSDS <b>10</b> may inform the user that someone attempted to send a message to the MSDS <b>10</b>.</p>\n  <p num=\"p-0142\">Moreover, the MSDS <b>10</b> has been described as having the central processor <b>3</b> for handling incoming calls and the Internet Server <b>10</b> for interfacing with the Internet <b>30</b>. The invention may be practiced in various ways other than with two separate processors. For instance, the central processor <b>3</b> and the Internet Server <b>5</b> may comprise a single computer or workstation for handling the incoming calls and for interfacing with the Internet <b>30</b>. The MSDS <b>10</b> may convert the messages into HTML files prior to storing the messages. Also, the central processor <b>3</b> may communicate with the paging system <b>13</b> instead of the Internet Server <b>5</b>. Additionally, as discussed above, the central processor <b>3</b> may comprise a number of microprocessors <b>27</b> for handling a large number of DID trunks.</p>\n  <p num=\"p-0143\">The invention has been described as converting the messages into HTML and transmitting the HTML files over the Internet <b>30</b> to the computer <b>32</b>. The HTML format, however, is only the currently preferred format for exchanging information on the Internet <b>30</b> and is actually only one type of a Standard Generalized Mark-Up Language. The invention is therefore not limited to the HTML format but may be practiced with any type of mixed media page layout language that can be used to exchange information on the Internet <b>30</b>.</p>\n  <p num=\"p-0144\">SGML is not limited to any specific standard but encompasses numerous dialects and variations in languages. One example of an SGML dialect is virtual reality mark-up language (VRML) which is used to deliver three dimensional images through the Internet. As another example, the computer <b>32</b> for accessing the MSDS <b>10</b> through the Internet <b>30</b> may comprise a handheld device. A handheld device is generally characterized by a small display size, limited input capabilities, limited bandwidth, and limited resources, such as limited amount of memory, processing power, or permanent storage. In view of these limited capabilities, a handheld device markup language (HDML) has been proposed to provide easy access to the Internet <b>30</b> for handheld devices. The SGML information transmitted by the MSDS <b>10</b> to the computer <b>32</b> may therefore comprise HDML information suitable for a handheld device or may comprise VRML.</p>\n  <p num=\"p-0145\">As another example, Extensible Mark-Up Language (XML) is an abbreviated version of SGML, which makes it easier to define document types and makes it easier for programmers to write programs to handle them. XML omits some more complex and some less-used parts of the standard SGML in return for the benefits of being easier to write applications for, easier to understand, and more suited to delivery and inter-operability over the Web. Because XML is nonetheless a dialect of SGML, the MSDS <b>10</b> therefore encompasses the translation of facsimile, voice, and data messages into XML, including all of its dialects and variations, and the delivery of these messages to computers <b>32</b> through the Internet <b>30</b>.</p>\n  <p num=\"p-0146\">As a further example, the MSDS <b>10</b> encompasses the use of &#x201C;dynamic HTML.&#x201D; &#x201C;Dynamic HTML&#x201D; is a term that has been used to describe the combination of HTML, style sheets, and scripts that allows documents to be animated. The Document Object Model (DOM) is a platform-neutral and language neutral interface allowing dynamic access and updating of content, structure, and style of documents. The MSDS <b>10</b> may therefore include the use of the DOM and dynamic HTML to deliver dynamic content to the computer <b>32</b> through the Internet <b>30</b>.</p>\n  <p num=\"p-0147\">The MSDS <b>10</b> is also not limited to any particular version or standard of HTTP and thus not to any particular hyper-text transfer protocol deamon <b>37</b>. In general, HTTP is a data access protocol run over TCP and is the basis of the World Wide Web. HTTP began as a generic request-response protocol, designed to accommodate a variety of applications ranging from document exchange and management to searching and forms processing. Through the development of HTTP, the request for extensions and new features to HTTP has exploded; such extensions range from caching, distributed authoring and content negotiation to various remote procedure call mechanisms. By not having a modularized architecture, the price of new features has been an overly complex and incomprehensible protocol. For instance, a Protocol Extension Protocol (PEP) is an extension mechanism for HTTP designed to address the tension between private agreement and public specification and to accommodate extension of HTTP clients and servers by software components. Multiplexing Protocol (MUX) is another extension that introduces asynchronous messaging support at a layer below HTTP. As a result of these drawbacks of HTTP, a new version of HTTP, namely HTTP-NG, has been proposed and its purpose is to provide a new architecture for the HTTP protocol based on a simple, extensible distributed object-oriented model. HTTP-NG, for instance, provides support for commercial transactions including enhanced security and support for on-line payments. Another version of HTTP, namely S-HTTP, provides secure messaging. The MSDS <b>10</b> and the HTTPD <b>37</b> may incorporate these versions or other versions of HTTP.</p>\n  <p num=\"p-0148\">In addition to different versions of HTTP, the HTTPD <b>37</b> of the MSDS <b>10</b> may operate with other implementations of HTTP. For instance, the W3C'\"'\"'s has an implementation of HTTP called &#x201C;Jigsaw.&#x201D; Jigsaw is an HTTP server entirely written in Java and provides benefits in terms of portability, extensibility, and efficiency. The MSDS <b>10</b> may employ Jigsaw or other implementations of HTTP.</p>\n  <p num=\"p-0149\">With regard to the transmission of messages to the user'\"'\"'s computer <b>32</b>, the MSDS <b>10</b> permits the user to sample the voice message or to preview the facsimile message without requiring the MSDS <b>10</b> to transmit the entire message to the computer <b>32</b>. This sampling ability is a significant benefit since the transmission of the entire message would frequently tie up the computer <b>32</b> for a rather long period of time. Thus, with the preview or sample feature, the user can determine whether the user needs the message transmitted to the computer <b>32</b>.</p>\n  <p num=\"p-0150\">If the user does decide that the entire message needs to be transmitted, as stated above, the user'\"'\"'s computer <b>32</b> might be receiving the message for a relatively long period of time. After the entire message has been received, the user then has the options of viewing, listening, retrieving, or saving the message. As an alternative, the user'\"'\"'s computer may instead indicate the contents of the message to the user as the message is being received.</p>\n  <p num=\"p-0151\">For instance, with a voice message, the user'\"'\"'s computer <b>32</b> could send the message to an audio speaker as the message is being received. In this manner, the message would be played in real time and the user would not need to wait until the entire message is received before listening to the message. In order to play the messages in real time, the messages are preferably in the RealAudio (RA) format, which the user can select as the preferred file format for voice messages.</p>\n  <p num=\"p-0152\">In operation, the MSDS <b>10</b> would transmit an HTML file containing an RA file. If the user selects the RA file with the browser on the computer <b>32</b>, the browser will activate a program for use with RA files. The operations and functioning of this program will be apparent to those skilled in the art and will be available as a separate software package or will be incorporated within a browser program. The RA program will request the RA data file containing the message from the MSDS <b>10</b> and, as the RA file is being received at the computer <b>32</b>, this program will play the message in real time.</p>\n  <p num=\"p-0153\">The MSDS <b>10</b> and the user'\"'\"'s computer <b>32</b> could also be arranged so that each page or even line of a facsimile message could be displayed as the computer <b>32</b> receives the facsimile message. Further, although the transmission of a data message is relatively fast in comparison to a voice or facsimile message, the computer <b>32</b> could also be programmed to permit access to the data message as the message is being received.</p>\n  <p num=\"p-0154\">The invention has been described as storing and transmitting voice messages. It should be understood that the voice message would probably be the most often type of audio message stored at the MSDS <b>10</b>. The invention, however, may be used with any type of audio message and is in no way limited to just voice messages.</p>\n  <p num=\"p-0155\">According to another aspect of the invention, the MSDS <b>10</b> may be used as a file repository serving as an archive for a particular user or group of users. As described above, the MSDS <b>10</b> may maintain a list of all messages for a particular user which is displayed to the user when the user access his or her mailbox. The MSDS <b>10</b> may store all messages, whether they are voice, facsimile, or data, for a user in the database indefinitely. The MSDS <b>10</b> may therefore be relied upon by a user to establish the authenticity of a message and the existence or absence of a particular message. Through the MSDS <b>10</b>, a user can therefore maintain an accurate record of all received email messages, facsimile messages, and data transfers.</p>\n  <p num=\"p-0156\">In addition to serving as a file depository, the MSDS <b>10</b> may also function as a document management tool. As described above with reference to <figref idrefs=\"DRAWINGS\">FIG. 2</figref>, when the MSDS <b>10</b> receives a message, the MSDS <b>10</b> updates a database with information on the message. This information includes the type of message, whether it is a facsimile message, voice message, or data message, the time and date at which the message was received, the size of the file, such as in bytes, the telephone number of the caller leaving the message, as well as other information, such as the number of pages of a facsimile message. Because the telephone number called is unique for each user, the information also includes the intended recipient of the message.</p>\n  <p num=\"p-0157\">An example of a data entry <b>300</b> in storage <b>11</b> for a message is shown in <figref idrefs=\"DRAWINGS\">FIG. 17</figref>. The data entry <b>300</b> represents the entry for just a single message with each message having a separate data entry <b>300</b>. Preferably, the data entries <b>300</b> are stored in a relational database and may be searched through a structured query language (SQL).</p>\n  <p num=\"p-0158\">As shown in <figref idrefs=\"DRAWINGS\">FIG. 17</figref>, the data field <b>300</b> for a message may comprise numerous data fields for describing the message. One of these data fields may comprise a field <b>301</b> for indicating the name of the person receiving the message. As will be appreciated by those skilled in the art, the person may be identified in numerous ways, such as by a portion of the person'\"'\"'s name or by a unique number. Another field <b>302</b> in the data entry <b>300</b> indicates the type of the document, such as whether the document is a facsimile message, voice message, or data transfer, and fields <b>303</b> and <b>304</b> respectively indicate the date and time that the message was received by the MSDS <b>10</b>. The telephone number of the caller is indicated in field <b>305</b> while the size of the message, which may be measured in bytes, is indicated in field <b>306</b> and the number of pages of the message is indicated in field <b>307</b>. A document number for uniquely identifying the message is indicated in field <b>308</b>. As discussed above, the files or messages received for a particular user may be numbered sequentially in the order that they are received by the MSDS <b>10</b>. The files and messages, however, may be numbered or identified in other ways, such as by a combination of numbers with an identifier for the date when the message was received. Also, the documents number or identifier may be unique for each file or message directed to a user or, alternatively, may be unique for each file or message directed to a plurality of users, which is advantageous when the MSDS <b>10</b> tracks documents for an entire company or other group of users.</p>\n  <p num=\"p-0159\">In addition to fields <b>301</b> to <b>308</b>, the data entry <b>300</b> for a message or file may have other fields <b>309</b> for describing or documenting the message or file. The other fields <b>309</b>, for instance, may be used to identify the type of storage that a message should receive. The messages or files may have different lengths of time that the message is stored before being automatically deleted. The type of storage, such as whether the full text of the message is stored, may also be indicated by field <b>309</b>. Another example of a trait that may be contained within the other field <b>309</b> is security. At times, a user may desire and may be granted access to another person'\"'\"'s mailbox, such when the MSDS <b>10</b> tracks documents for an entire company. By designating a message or file as secure in field <b>309</b>, a user may restrict or deny access to that message or file by other users. The other fields <b>309</b> may also be used by a user to customize the MSDS <b>10</b> according to his or her own desires. For instance, if the user is a company, the company may want to classify messages according to the division at which the message is directed, such as one code for marketing, one for sales, one for engineering, and one for legal.</p>\n  <p num=\"p-0160\">As another example of a use of one of the other fields <b>309</b>, a user can input notes in the other field <b>309</b>. When a user initially receives a data entry <b>300</b>, the entry <b>300</b>, for instance, may include data in all fields <b>301</b> to <b>308</b> except field <b>309</b>, which has been left blank. The user can then input his or her notes in the other field. An initial data entry <b>300</b> may include the field <b>305</b> for the caller'\"'\"'s telephone number which contains the digits for the calling number. The user, however, may not readily recognize the caller from just reading the telephone number listed in field <b>305</b>. To more clearly indicate the caller, the user may input notes in field <b>309</b> to identify the caller'\"'\"'s name. Alternatively, the notes in field <b>309</b> may reflect part or all of the contents of the message. The user may receive a large document or message and may input a brief description of the document or message in the field <b>309</b>. As another example, the recipient of the message may read the message or document and discover that the caller is requesting some service or goods from the recipient, such as a request for certain documents or delivery of a certain quantity of goods. The recipient may read the document or message and place some notes in the field <b>309</b> to indicate the type of follow-up service or action that needs to be taken. An assistant to the recipient can then view the notes in field <b>309</b> and take appropriate steps to ensure that the requested service or goods are delivered. If the data entry is security protected, one of the other fields <b>309</b>, as discussed above, may grant the assistant limited access to just the field <b>309</b> or may grant more expansive access whereby the assistant can view fields <b>301</b> to <b>309</b> as well as the actual document or message. The fields <b>309</b> may serve various other purposes, as will be apparent to those skilled in the art.</p>\n  <p num=\"p-0161\"><figref idrefs=\"DRAWINGS\">FIG. 18</figref> illustrates a process <b>320</b> for using the MSDS <b>10</b> for document management purposes. With reference to <figref idrefs=\"DRAWINGS\">FIG. 18</figref>, a user sends a search request to the MSDS <b>10</b> for a particular document or set of documents at step <b>321</b>. The user may issue this request with the computer <b>32</b> by clicking on a link, such as a link to &#x201C;Search Documents,&#x201D; which may be presented to the user by the MSDS <b>10</b> after the user has been granted accesses to his or her mailbox at step <b>72</b> shown in <figref idrefs=\"DRAWINGS\">FIG. 3</figref>. The MSDS <b>10</b> may present the user with the option to search the document archives at other times, such as when the user first attempts to access the mailbox at step <b>62</b>, or when the URL received by the HTTPD <b>37</b> from computer <b>32</b> points toward the document archives.</p>\n  <p num=\"p-0162\">In response to this request, the HTTPD <b>37</b> sends the user a search query form at step <b>322</b> to allow the user to define a desired search. An example of a search query form is shown in <figref idrefs=\"DRAWINGS\">FIG. 19</figref>. The search query form may include an entry for each of the data fields <b>301</b> to <b>309</b> in the data entry <b>300</b>. For instance, the user may input one or more names for a recipient and have the MSDS <b>10</b> search for all messages or files directed to just those recipients. The user may also indicate the type of document, such as whether it is a facsimile, voice message or data file. The search query form also has entries for the date or time, which preferably accept ranges of times and dates, and an entry for the telephone number of the caller to the MSDS <b>10</b>. The search query form may also include an entry for the size of the file or for the number of pages, which is relevant if the message is a facsimile message. The search query form may also include an entry for the document number, which may accept a range of document numbers, and also an entry for another field.</p>\n  <p num=\"p-0163\">At step <b>323</b>, the user enters the search parameters in the search query form with computer <b>32</b> and returns the information to the MSDS <b>10</b> through the Internet <b>30</b>. The user may define the search about any one data field or may define the search about a combination of two or more data fields. For instance, as reflected in the completed search query form shown in <figref idrefs=\"DRAWINGS\">FIG. 20</figref>, a user may define a search by designating the document type as a facsimile and the calling number as (404) 249-6801. Once the user has finished defining the search, the user then selects the &#x201C;SEARCH&#x201D; link shown at the bottom of the screen whereby the user'\"'\"'s computer <b>32</b> would send the completed search query form through the Internet <b>30</b> to the HTTPD <b>37</b> of the MSDS <b>10</b>.</p>\n  <p num=\"p-0164\">At step <b>324</b>, the HTTPD <b>37</b> receives the completed search query form and, through CGI <b>35</b>, invokes one or more of the application programs <b>31</b> for performing the desired search for any files or messages falling within the parameters of the search. The results of the search are passed from the application programs <b>31</b> through the CGI <b>35</b> to the HTTPD <b>37</b> and, at step <b>325</b>, are returned to the user through the Internet <b>37</b>. Preferably, the MSDS <b>10</b> returns the search results in the form of a listing of all files or messages contained within the search parameters, although the MSDS <b>10</b> may return the results in other ways.</p>\n  <p num=\"p-0165\">An example of the search results of the query shown in <figref idrefs=\"DRAWINGS\">FIG. 20</figref> is shown in <figref idrefs=\"DRAWINGS\">FIG. 21</figref>. As discussed above, the parameters of the search were all facsimile messages from telephone number (404) 249-6081. With reference to <figref idrefs=\"DRAWINGS\">FIG. 21</figref>, this query resulted in three messages being discovered. The first document has a document number <b>11</b> and is described as being a facsimile from the designated telephone number to Jane Doe on May 31, 1995, and consists of three pages. This first-listed document is an example of the facsimile shown in <figref idrefs=\"DRAWINGS\">FIG. 7</figref>. The other two documents respectively correspond to document numbers 243 and 1,002 and are also from the designated telephone number.</p>\n  <p num=\"p-0166\">At step <b>326</b>, the user selects the desired file or message from the listing of messages and files. For instance, by clicking on the first listed document, namely document number <b>11</b>, the computer <b>32</b> sends a request to the MSDS <b>10</b> for a viewing of that document and, in response, the MSDS <b>10</b> provides a viewing of the document according to the user defined preferences. As described above, the user may receive a reduced size image of the first page, a full size image of the first page, reduced size images of all pages, or full size images of all pages of the facsimile message. Thus, if the user selected the fourth display option as the user defined preference, the MSDS <b>10</b> would return an image of the first page of the facsimile, such as the one depicted in <figref idrefs=\"DRAWINGS\">FIG. 7</figref>.</p>\n  <p num=\"p-0167\">At step <b>326</b>, the user may also have the MSDS <b>10</b> save the search results. For instance, as shown in <figref idrefs=\"DRAWINGS\">FIG. 21</figref>, the user may input the name of &#x201C;CHARLES R. BOBO FACSIMILES&#x201D; as the name for the search. By clicking on the &#x201C;SAVE SEARCH AS&#x201D; link, the name of the search is provided from the computer <b>32</b> to the MSDS <b>10</b>. At the MSDS <b>10</b>, the HTTPD <b>37</b> transfers the information from the computer <b>32</b> to the CGI <b>35</b> and the CGI <b>35</b> invokes an application program <b>31</b> to store the results of the search in storage <b>11</b> under the designated name. The invoked application program <b>31</b> preferably does not store the contents of all messages but rather stores a listing of the search results in the storage <b>11</b>.</p>\n  <p num=\"p-0168\">The results of a search may be stored in storage <b>11</b> as either a closed search or an open search. If the MSDS <b>10</b> saves the results of a search as an open search, then the files or messages in that named search may be updated with recent files or messages falling within the particular search parameters for the search. On the other hand, a closed search is one in which the files or messages in the named search are limited to those existing at the time of the search. For example, if the MSDS <b>10</b> saved the search results shown in <figref idrefs=\"DRAWINGS\">FIG. 21</figref> as a closed search, then any retrieval of the &#x201C;CHARLES R. BOBO FACSIMILES&#x201D; would result in only the three listed documents. If, on the other hand, the search named as the &#x201C;CHARLES R BOBO FACSIMILES&#x201D; was saved by the MSDS <b>10</b> as an open search, then the MSDS <b>10</b> would reactivate the search query shown in <figref idrefs=\"DRAWINGS\">FIG. 20</figref> in response to a request by the computer <b>32</b> for that search in order to obtain all facsimile messages from that particular telephone number, including those received after the initial saving of the search results.</p>\n  <p num=\"p-0169\">With reference to <figref idrefs=\"DRAWINGS\">FIG. 19</figref>, rather than defining a new search, the user may click on the &#x201C;STORED SEARCHES&#x201D; link in order to receive the results of a previously performed search. For example, by clicking on this link, the MSDS <b>10</b> may return a listing of searches stored for that particular user, such as the searches shown in <figref idrefs=\"DRAWINGS\">FIG. 22</figref>. As shown in this figure, the &#x201C;CHARLES R. BOBO FACSIMILES&#x201D; is included within the list of stored searches. If the user then selected the &#x201C;CHARLES R. BOBO FACSIMILES&#x201D; search, the user may then be presented with the listing of facsimiles shown in <figref idrefs=\"DRAWINGS\">FIG. 21</figref>, possibly including recent additions to the search group.</p>\n  <p num=\"p-0170\">With reference to <figref idrefs=\"DRAWINGS\">FIG. 19</figref>, the MSDS <b>10</b> may also provide a user with a link to &#x201C;RECENT FILES&#x201D; at step <b>322</b>. By selecting this link, the MSDS <b>10</b> may return a listing of all facsimile, voice, and data messages received with a particular period of time, such as the last month. By placing the &#x201C;RECENT FILES&#x201D; link on the search query form rather than in the listing of &#x201C;STORED SEARCHES,&#x201D; the user can quickly turn to the most recent files and messages. The search query form may contain other such easy-access links, such as a link to the last search performed by the MSDS <b>10</b> on behalf of the user.</p>\n  <p num=\"p-0171\">The messages or files received by the MSDS <b>10</b> need not arrive from a third party. In other words, the MSDS <b>10</b> may be used as a file repository or as a file manager for documents generated by the user itself. The user may call the designated telephone number for receiving messages and transmit voice messages, data messages, or facsimile messages and have the MSDS <b>10</b> document the receipt and content of these messages. A user may easily use a facsimile machine as a scanner for entering documents into the storage <b>11</b> of the MSDS <b>10</b>.</p>\n  <p num=\"p-0172\">The MSDS <b>10</b> may have applications in addition to those discussed-above with regard to serving as a message deliverer, file repository, and file manager. For instance, the MSDS to may perform some additional processing on the incoming calls prior to forwarding them to the user. For voice messages, this processing may involve transcribing the message and then returning the transcribed messages to the user. The MSDS <b>10</b> may therefore be viewed as offering secretarial assistance which may be invaluable to small companies or individuals who cannot afford a secretary or even to larger businesses who may need some over-flow assistance. The transcription may be provided by individuals located in any part of the world or may be performed automatically by a speech-to-text recognition software, such as VoiceType from IBM.</p>\n  <p num=\"p-0173\">Another type of processing that the MSDS <b>10</b> may provide is translation services. The incoming call, whether it is a voice, facsimile, or data message, can be converted into SGML and then forwarded first to a translator. Given the reach of the Internet, the translator may be located virtually anywhere in the world and can return the translated document via the Internet to the MSDS <b>10</b>. The MSDS <b>10</b> can notify the user that the translation has been completed through email, voice mail, pager, facsimile, or in other ways. The user would then connect to the Internet and retrieve the translated document. The translation services of the MSDS <b>10</b> may also provide transcription of the message, such as with speech-to-text recognition software.</p>\n  <p num=\"p-0174\">The foregoing description of the preferred embodiments of the invention have been presented only for the purposes of illustration and description. It is not intended to be exhaustive or to limit the invention to the precise form disclosed. Many modifications and variations are possible in light of the above teaching.</p>\n  <p num=\"p-0175\">The embodiments were chosen and described in order to explain the principles of the invention and their practical application so as to enable others skilled in the art to utilize the invention and various embodiments and with various modifications as are suited to the particular use contemplated. It is intended that the scope of the invention only be limited by the claims appended hereto.</p>\n  <?DETDESC description=\"Detailed Description\" end=\"tail\"?>\n</description>"
  },
  "international_convention_data":{

  },
  "ifi_integrated_content":{
    "1":[

    ],
    "2":[
      1
    ],
    "3":[
      2
    ],
    "4":[
      1
    ],
    "5":[
      1
    ],
    "6":[
      1
    ],
    "7":[
      1
    ],
    "8":[
      1
    ],
    "9":[
      8
    ],
    "10":[
      1
    ],
    "11":[
      1
    ],
    "12":[
      1
    ],
    "13":[
      12
    ],
    "14":[
      1
    ],
    "15":[
      1
    ],
    "16":[
      15
    ],
    "17":[
      16
    ],
    "18":[
      17
    ],
    "19":[
      18
    ],
    "20":[
      18
    ],
    "21":[
      18
    ],
    "22":[
      18
    ],
    "23":[
      18
    ],
    "24":[
      1
    ],
    "25":[
      24
    ],
    "26":[
      25
    ],
    "27":[
      26
    ],
    "28":[
      27
    ],
    "29":[
      28
    ],
    "30":[
      29
    ],
    "31":[
      1
    ],
    "32":[
      1
    ],
    "33":[
      1
    ],
    "34":[
      1
    ],
    "35":[
      1
    ],
    "36":[
      1
    ],
    "37":[
      1
    ],
    "38":[
      37
    ],
    "39":[
      37
    ],
    "40":[
      1
    ],
    "41":[

    ],
    "42":[
      41
    ],
    "43":[
      42
    ],
    "44":[
      42
    ],
    "45":[
      44
    ],
    "46":[
      42
    ],
    "47":[
      41
    ],
    "48":[
      41
    ],
    "49":[
      41
    ],
    "50":[
      41
    ],
    "51":[

    ],
    "52":[

    ],
    "53":[

    ],
    "54":[
      53
    ],
    "55":[
      53
    ]
  },
  "country":"US",
  "doc_number":"7895306",
  "kind":"B2",
  "patnum":"US7895306B2",
  "publication_id":"113463593"
}