{
  "claims":[
    {
      "claim_text":"<claim-text>1. A light emitting panel assembly comprising:<claim-text>a light emitting panel member comprising a first major surface, a second major surface opposite the first major surface, and a light transition area that is an integral extension of the light emitting panel member at an end thereof;</claim-text><claim-text>an optical film or sheet overlying the first major surface; and</claim-text><claim-text>LED light sources optically coupled to the light transition area such that light emitted from the LED light sources is mixed and transmitted by the light transition area to the light emitting panel member as a whole, wherein:</claim-text><claim-text>the light emitting panel member has a pattern of light extracting deformities on or in at least one of the major surfaces, the light extracting deformities are configured to cause light to be emitted from the first major surface with a predetermined light ray angle distribution; and</claim-text><claim-text>the light transition area has faceted refractive surfaces associated with each LED light source that redirect the light entering the light emitting panel member; and</claim-text><claim-text>wherein there is a pattern of light extracting deformities on or in the first major surface and the second major surface, the light extracting deformities on or in the first major surface being different from the light extracting deformities on or in the second major surface.</claim-text></claim-text>",
      "claim_num":1,
      "word_count":406,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>2. A display device comprising the light emitting panel assembly of <claim-ref idref=\"CLM-00001\">claim 1</claim-ref> and a liquid crystal display panel.</claim-text>",
      "claim_num":2,
      "word_count":18,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>3. The light emitting panel assembly of <claim-ref idref=\"CLM-00001\">claim 1</claim-ref> wherein the pattern of light extracting deformities comprises individual optical elements.</claim-text>",
      "claim_num":3,
      "word_count":19,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>4. The light emitting panel assembly of <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, additionally comprising a tray that holds the light emitting panel member and the LED light sources, the tray having a reflective surface that reflects light that would otherwise escape from the light emitting panel member.</claim-text>",
      "claim_num":4,
      "word_count":43,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>5. The light emitting panel assembly of <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the pattern of light extracting deformities varies randomly.</claim-text>",
      "claim_num":5,
      "word_count":17,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>6. The light emitting panel assembly of <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the pattern of light extracting deformities varies along the length and width of the light emitting panel member.</claim-text>",
      "claim_num":6,
      "word_count":27,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>7. The light emitting panel assembly of <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the light extracting deformities are prismatic or lenticular.</claim-text>",
      "claim_num":7,
      "word_count":17,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>8. The light emitting panel assembly of <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the pattern of light extracting deformities is a coating.</claim-text>",
      "claim_num":8,
      "word_count":18,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>9. The light emitting panel assembly of <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein the light extracting deformities vary in at least one of the following characteristics: shape, depth, height, density, opaqueness, size, slope angle, and orientation.</claim-text>",
      "claim_num":9,
      "word_count":32,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>10. A light emitting panel assembly comprising:<claim-text>a light emitting panel member comprising a first major surface, a second major surface opposite the first major surface, and a light transition area that is an integral extension of the light emitting panel member at an end thereof;</claim-text><claim-text>an optical film or sheet overlying the first major surface; and</claim-text><claim-text>LED light sources optically coupled to the light transition area such that light emitted from the LED light sources is mixed and transmitted by the light transition area to the light emitting panel member as a whole, wherein:</claim-text><claim-text>the light emitting panel member has a pattern of light extracting deformities on or in at least one of the major surfaces, the light extracting deformities are configured to cause light to be emitted from the first major surface with a predetermined light ray angle distribution; and</claim-text><claim-text>the light transition area has faceted refractive surfaces associated with each LED light source that redirect the light entering the light emitting panel member; and</claim-text><claim-text>wherein the pattern of light extracting deformities varies in refractive index.</claim-text></claim-text>",
      "claim_num":10,
      "word_count":336,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>11. A light emitting panel assembly comprising:<claim-text>a light emitting panel member comprising a first major surface, a second major surface opposite the first major surface, and a light transition area that is an integral extension of the light emitting panel member at an end thereof;</claim-text><claim-text>an optical film or sheet overlying the first major surface; and</claim-text><claim-text>LED light sources optically coupled to the light transition area such that light emitted from the LED light sources is mixed and transmitted by the light transition area to the light emitting panel member as a whole, wherein:</claim-text><claim-text>the light emitting panel member has a pattern of light extracting deformities on or in at least one of the major surfaces, the light extracting deformities are configured to cause light to be emitted from the first major surface with a predetermined light ray angle distribution; and</claim-text><claim-text>the light transition area has faceted refractive surfaces associated with each LED light source that redirect the light entering the light emitting panel member; and</claim-text><claim-text>wherein there is an air gap between the light emitting panel member and the film or sheet, the film or sheet having a pattern of deformities on one side of the film or sheet, the deformities on the film or sheet having a width and length that is quite small in relation to a width and length of the film or sheet, the deformities on the film or sheet vary at different locations on the film or sheet to direct the light emitted by the first major surface of the light emitting panel member in different directions to produce a desired light output distribution.</claim-text></claim-text>",
      "claim_num":11,
      "word_count":522,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>12. The light emitting panel assembly of <claim-ref idref=\"CLM-00011\">claim 11</claim-ref>, wherein the deformities on the film or sheet vary in refractive index at different locations.</claim-text>",
      "claim_num":12,
      "word_count":23,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>13. The light emitting panel assembly of <claim-ref idref=\"CLM-00011\">claim 11</claim-ref>, wherein the film or sheet comprises multiple layers.</claim-text>",
      "claim_num":13,
      "word_count":16,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>14. The light emitting panel assembly of <claim-ref idref=\"CLM-00011\">claim 11</claim-ref>, wherein the film or sheet comprises multiple materials.</claim-text>",
      "claim_num":14,
      "word_count":16,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>15. A light emitting panel assembly comprising:<claim-text>a light emitting panel member comprising a first major surface, a second major surface opposite the first major surface, and a light transition area that is an integral extension of the light emitting panel member at an end thereof;</claim-text><claim-text>an optical film or sheet overlying the first major surface; and</claim-text><claim-text>LED light sources optically coupled to the light transition area such that light emitted from the LED light sources is mixed and transmitted by the light transition area to the light emitting panel member as a whole, wherein:</claim-text><claim-text>the light emitting panel member has a pattern of light extracting deformities on or in at least one of the major surfaces, the light extracting deformities are configured to cause light to be emitted from the first major surface with a predetermined light ray angle distribution; and</claim-text><claim-text>the light transition area has faceted refractive surfaces associated with each LED light source that redirect the light entering the light emitting panel member; and</claim-text><claim-text>wherein the LED light sources are configured to generate light having an output distribution defined by a greater width component than height component, the height component of the LED light sources corresponding to a thickness direction of the light emitting panel member.</claim-text></claim-text>",
      "claim_num":15,
      "word_count":398,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>16. The light emitting panel assembly of <claim-ref idref=\"CLM-00015\">claim 15</claim-ref>, wherein the LED light sources are embedded in, potted in, or bonded to the light transition area so as to eliminate any air interface between the LED light sources and the light transition area.</claim-text>",
      "claim_num":16,
      "word_count":42,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>17. The light emitting panel assembly of <claim-ref idref=\"CLM-00015\">claim 15</claim-ref>, wherein the LED light sources are mounted in a recess, slot, or cavity in the light transition area, the recess, slot, or cavity being filled with a transparent medium to eliminate air interface.</claim-text>",
      "claim_num":17,
      "word_count":41,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>18. The light emitting panel assembly of <claim-ref idref=\"CLM-00015\">claim 15</claim-ref>, wherein the LED light sources emit focused light.</claim-text>",
      "claim_num":18,
      "word_count":16,
      "depends_on":null
    },
    {
      "claim_text":"<claim-text>19. The light emitting panel assembly of <claim-ref idref=\"CLM-00015\">claim 15</claim-ref>, wherein the LED light sources are different colored LEDs.</claim-text>",
      "claim_num":19,
      "word_count":17,
      "depends_on":null
    }
  ],
  "abstract":{
    "abstract_text":"<p num=\"p-0001\">Light emitting assembly includes an optical conductor having a pattern of deformities on or in front and back sides of the optical conductor to cause light to be emitted from a light emitting surface on at least one of the sides. At least one of the deformities varies, and at least one planar or curved refractive surface is aligned with at least one light source to redirect a portion of the light from the light source entering the optical conductor in a predetermined manner to cause the light emitted from the light emitting surface to pass through an optical film, which redirects the light through a liquid crystal display with no loss.</p>"
  },
  "description":{
    "description_text":"<description mxw-id=\"PDES42383142\" lang=\"EN\" load-source=\"patent-office\">\n  <?RELAPP description=\"Other Patent Relations\" end=\"lead\"?>\n  <heading>CROSS-REFERENCE TO RELATED APPLICATIONS</heading>\n  <p num=\"p-0002\">This application is a division of U.S. patent application Ser. No. 11/504,204, filed Aug. 15, 2006, now U.S. Pat. No. 7,703,967, which is a continuation of U.S. patent application Ser. No. 10/784,527, filed Feb. 23, 2004, now U.S. Pat. 7,160,015, dated Jan. 9, 2007, which is a division of U.S. patent application Ser. No. 09/256,275, filed Feb. 23, 1999, now U.S. Pat. No. 6,712,481, dated Mar. 30, 2004, which is a continuation-in-part of U.S. patent application Ser. No. 08/778,089, filed Jan. 2, 1997, now U.S. Pat. No. 6,079,838, dated Jun. 27, 2000, which is a division of U.S. patent application Ser. No. 08/495,176, filed Jun. 27, 1995, now U.S. Pat. No. 5,613,751, dated Mar. 25, 1997.</p>\n  <?RELAPP description=\"Other Patent Relations\" end=\"tail\"?>\n  <?BRFSUM description=\"Brief Summary\" end=\"lead\"?>\n  <heading>BACKGROUND OF THE INVENTION</heading>\n  <p num=\"p-0003\">This invention relates generally, as indicated, to light emitting panel assemblies each including a transparent panel member for efficiently conducting light, and controlling the light conducted by the panel member to be emitted from one or more light output areas along the length thereof.</p>\n  <p num=\"p-0004\">Light emitting panel assemblies are generally known. However, the present invention relates to several different light emitting panel assembly configurations which provide for better control of the light output from the panel assemblies and for more efficient utilization of light, which results in greater light output from the panel assemblies.</p>\n  <heading>SUMMARY OF THE INVENTION</heading>\n  <p num=\"p-0005\">In accordance with one aspect of the invention, the light emitting panel assemblies include a light emitting panel member having a light transition area in which at least one light source is suitably mounted for transmission of light to the light input surface of the panel member.</p>\n  <p num=\"p-0006\">In accordance with another aspect of the invention, the light source is desirably embedded, potted or bonded to the light transition area to eliminate any air gaps, decrease surface reflections and/or eliminate any lens effect between the light source and light transition area, thereby reducing light loss and increasing the light output from the panel assembly.</p>\n  <p num=\"p-0007\">In accordance with another aspect of the invention, the panel assemblies may include reflective or refractive surfaces for changing the path of a portion of the light, emitted from the light source, that would not normally enter the panel members at an acceptable angle that allows the light to remain in the panel members for a longer period of time and/or increase the efficiency of the panel members.</p>\n  <p num=\"p-0008\">In accordance with another aspect of the invention, the light emitting panel members include a pattern of light extracting deformities or disruptions which provide a desired light output distribution from the panel members by changing the angle of refraction of a portion of the light from one or more light output areas of the panel members.</p>\n  <p num=\"p-0009\">In accordance with still another aspect of the invention, the light source may include multiple colored light sources for supplying light to one or more light output areas, and for providing a colored or white light output distribution.</p>\n  <p num=\"p-0010\">In accordance with yet another aspect of the invention, the panel assemblies include a transition area for mixing the multiple colored lights, prior to the light entering the panel members, in order to effect a desired colored or white light output distribution.</p>\n  <p num=\"p-0011\">The various light emitting panel assemblies of the present invention are very efficient panel assemblies that may be used to produce increased uniformity and higher light output from the panel members with lower power requirements, and allow the panel members to be made thinner and/or longer, and/or of various shapes and sizes.</p>\n  <p num=\"p-0012\">To the accomplishment of the foregoing and related ends, the invention then comprises the features hereinafter fully described and particularly pointed out in the claims, the following description and the annexed drawings setting forth in detail certain illustrative embodiments of the invention, these being indicative, however, of but several of the various ways in which the principles of the invention may be employed.</p>\n  <?BRFSUM description=\"Brief Summary\" end=\"tail\"?>\n  <?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"lead\"?>\n  <description-of-drawings>\n    <heading>BRIEF DESCRIPTION OF THE DRAWINGS</heading>\n    <p num=\"p-0013\">In the annexed drawings:</p>\n    <p num=\"p-0014\"><figref idrefs=\"DRAWINGS\">FIGS. 1 through 3</figref> are schematic perspective views of three different forms of light emitting panel assemblies in accordance with this invention;</p>\n    <p num=\"p-0015\"><figref idrefs=\"DRAWINGS\">FIG. 4</figref><i>a </i>is an enlarged plan view of a portion of a light output area of a panel assembly showing one form of pattern of light extracting deformities on the light output area;</p>\n    <p num=\"p-0016\"><figref idrefs=\"DRAWINGS\">FIGS. 4</figref><i>b, c </i>and <i>d </i>are enlarged schematic perspective views of a portion of a light output area of a panel assembly showing other forms of light extracting deformities formed in or on the light output area;</p>\n    <p num=\"p-0017\"><figref idrefs=\"DRAWINGS\">FIG. 5</figref> is an enlarged transverse section through the light emitting panel assembly of <figref idrefs=\"DRAWINGS\">FIG. 3</figref> taken generally on the plane of the line <b>5</b>-<b>5</b> thereof;</p>\n    <p num=\"p-0018\"><figref idrefs=\"DRAWINGS\">FIG. 6</figref> is a schematic perspective view of another form of light emitting panel assembly in accordance with this invention;</p>\n    <p num=\"p-0019\"><figref idrefs=\"DRAWINGS\">FIG. 7</figref> is a schematic top plan view of another form of light emitting panel assembly in accordance with this invention;</p>\n    <p num=\"p-0020\"><figref idrefs=\"DRAWINGS\">FIG. 8</figref> is a schematic perspective view of another form of light emitting panel assembly in accordance with this invention;</p>\n    <p num=\"p-0021\"><figref idrefs=\"DRAWINGS\">FIG. 9</figref> is a schematic top plan view of another form of light emitting panel assembly in accordance with this invention;</p>\n    <p num=\"p-0022\"><figref idrefs=\"DRAWINGS\">FIG. 10</figref> is a schematic top plan view of still another form of light emitting panel assembly in accordance with this invention;</p>\n    <p num=\"p-0023\"><figref idrefs=\"DRAWINGS\">FIG. 11</figref> is a side elevation view of the light emitting panel assembly of <figref idrefs=\"DRAWINGS\">FIG. 10</figref>;</p>\n    <p num=\"p-0024\"><figref idrefs=\"DRAWINGS\">FIG. 11</figref><i>a </i>is a fragmentary side elevation view showing a tapered or rounded end on the panel member in place of the prismatic surface shown in <figref idrefs=\"DRAWINGS\">FIGS. 10 and 11</figref>;</p>\n    <p num=\"p-0025\"><figref idrefs=\"DRAWINGS\">FIG. 12</figref> is a schematic top plan view of another form of light emitting panel assembly in accordance with this invention;</p>\n    <p num=\"p-0026\"><figref idrefs=\"DRAWINGS\">FIG. 13</figref> is a schematic side elevation view of the light emitting panel assembly of <figref idrefs=\"DRAWINGS\">FIG. 12</figref>; and</p>\n    <p num=\"p-0027\"><figref idrefs=\"DRAWINGS\">FIGS. 14 and 15</figref> are schematic perspective views of still other forms of light emitting panel assemblies in accordance with this invention.</p>\n  </description-of-drawings>\n  <?brief-description-of-drawings description=\"Brief Description of Drawings\" end=\"tail\"?>\n  <?DETDESC description=\"Detailed Description\" end=\"lead\"?>\n  <heading>DETAILED DESCRIPTION OF THE PREFERRED EMBODIMENTS</heading>\n  <p num=\"p-0028\">Referring now in detail to the drawings, and initially to <figref idrefs=\"DRAWINGS\">FIG. 1</figref>, there is schematically shown one form of light emitting panel assembly <b>1</b> in accordance with this invention including a transparent light emitting panel <b>2</b> and one or more light sources <b>3</b> which emit light in a predetermined pattern in a light transition member or area <b>4</b> used to make the transition from the light source <b>3</b> to the light emitting panel <b>2</b>, as well known in the art. The light that is transmitted by the light transition area <b>4</b> to the transparent light emitting panel <b>2</b> may be emitted along the entire length of the panel or from one or more light output areas along the length of the panel as desired to produce a desired light output distribution to fit a particular application.</p>\n  <p num=\"p-0029\">In <figref idrefs=\"DRAWINGS\">FIG. 1</figref> the light transition area <b>4</b> is shown as an integral extension of one end of the light emitting panel <b>2</b> and as being generally rectangular in shape. However, the light transition area may be of other shapes suitable for embedding, potting, bonding or otherwise mounting the light source. Also, reflective or refractive surfaces may be provided to increase efficiency. Moreover, the light transition area <b>4</b> may be a separate piece suitably attached to the light input surface <b>13</b> of the panel member if desired. Also, the sides of the light transition area may be curved to more efficiently reflect or refract a portion of the light emitted from the light source through the light emitting panel at an acceptable angle.</p>\n  <p num=\"p-0030\"><figref idrefs=\"DRAWINGS\">FIG. 2</figref> shows another form of light emitting panel assembly <b>5</b> in accordance with this invention including a panel light transition area <b>6</b> at one end of the light emitting panel <b>7</b> with sides <b>8</b>, <b>9</b> around and behind the light source <b>3</b> shaped to more efficiently reflect and/or refract and focus the light emitted from the light source <b>3</b> that impinges on these surfaces back through the light transition area <b>6</b> at an acceptable angle for entering the light input surface <b>18</b> at one end of the light emitting panel <b>7</b>. Also, a suitable reflective material or coating <b>10</b> may be provided on the portions of the sides of the light transition areas of the panel assemblies of <figref idrefs=\"DRAWINGS\">FIGS. 1 and 2</figref> on which a portion of the light impinges for maximizing the amount of light or otherwise changing the light that is reflected back through the light transition areas and into the light emitting panels.</p>\n  <p num=\"p-0031\">The panel assemblies shown in <figref idrefs=\"DRAWINGS\">FIGS. 1 and 2</figref> include a single light source <b>3</b>, whereas <figref idrefs=\"DRAWINGS\">FIG. 3</figref> shows another light emitting panel assembly <b>11</b> in accordance with this invention including two light sources <b>3</b>. Of course, it will be appreciated that the panel assemblies of the present invention may be provided with any number of light sources as desired, depending on the particular application.</p>\n  <p num=\"p-0032\">The panel assembly <b>11</b> of <figref idrefs=\"DRAWINGS\">FIG. 3</figref> includes a light transition area <b>12</b> at one end of the light emitting panel <b>14</b> having reflective and/or refractive surfaces <b>15</b> around and behind each light source <b>3</b>. These surfaces <b>15</b> may be appropriately shaped including for example curved, straight and/or faceted surfaces, and if desired, suitable reflective materials or coatings may be provided on portions of these surfaces to more efficiently reflect and/or refract and focus a portion of the light emitted for example from an incandescent light source which emits light in a 360&#xB0; pattern through the light transition areas <b>12</b> into the light input surface <b>19</b> of the light emitting panel <b>14</b>.</p>\n  <p num=\"p-0033\">The light sources <b>3</b> may be mechanically held in any suitable manner in slots, cavities or openings <b>16</b> machined, molded or otherwise formed in the light transition areas of the panel assemblies. However, preferably the light sources <b>3</b> are embedded, potted or bonded in the light transition areas in order to eliminate any air gaps or air interface surfaces between the light sources and surrounding light transition areas, thereby reducing light loss and increasing the light output emitted by the light emitting panels. Such mounting of the light sources may be accomplished, for example, by bonding the light sources <b>3</b> in the slots, cavities or openings <b>16</b> in the light transition areas using a sufficient quantity of a suitable embedding, potting or bonding material <b>17</b>. The slots, cavities or openings <b>16</b> may be on the top, bottom, sides or back of the light transition areas. Bonding can also be accomplished by a variety of methods that do not incorporate extra material, for example, thermal bonding, heat staking, ultrasonic or plastic welding or the like. Other methods of bonding include insert molding and casting around the light source(s).</p>\n  <p num=\"p-0034\">A transparent light emitting material of any suitable type, for example acrylic or polycarbonate, may be used for the light emitting panels. Also, the panels may be substantially flat, or curved, may be a single layer or multi-layers, and may have different thicknesses and shapes. Moreover, the panels may be flexible, or rigid, and may be made out of a variety of compounds. Further, the panels may be hollow, filled with liquid, air, or be solid, and may have holes or ridges in the panels.</p>\n  <p num=\"p-0035\">Each light source <b>3</b> may also be of any suitable type including, for example, any of the types disclosed in U.S. Pat. Nos. 4,897,771 and 5,005,108, assigned to the same assignee as the present application, the entire disclosures of which are incorporated herein by reference. In particular, the light sources <b>3</b> may be an arc lamp, an incandescent bulb which also may be colored, filtered or painted, a lens end bulb, a line light, a halogen lamp, a light emitting diode (LED), a chip from an LED, a neon bulb, a fluorescent tube, a fiber optic light pipe transmitting from a remote source, a laser or laser diode, or any other suitable light source. Additionally, the light sources <b>3</b> may be a multiple colored LED, or a combination of multiple colored radiation sources in order to provide a desired colored or white light output distribution. For example, a plurality of colored lights such as LEDs of different colors (red, blue, green) or a single LED with multiple colored chips may be employed to create white light or any other colored light output distribution by varying the intensities of each individual colored light.</p>\n  <p num=\"p-0036\">A pattern of light extracting deformities or disruptions may be provided on one or both sides of the panel members or on one or more selected areas on one or both sides of the panel members, as desired. <figref idrefs=\"DRAWINGS\">FIG. 4</figref><i>a </i>schematically shows one such light surface area <b>20</b> on which a pattern of light extracting deformities or disruptions <b>21</b> is provided. As used herein, the term deformities or disruptions are used interchangeably to mean any change in the shape or geometry of the panel surface and/or coating or surface treatment that causes a portion of the light to be emitted. The pattern of light extracting deformities <b>21</b> shown in <figref idrefs=\"DRAWINGS\">FIG. 4</figref><i>a </i>includes a variable pattern which breaks up the light rays such that the internal angle of reflection of a portion of the light rays will be great enough to cause the light rays either to be emitted out of the panel through the side or sides on which the light extracting deformities <b>21</b> are provided or reflected back through the panel and emitted out the other side.</p>\n  <p num=\"p-0037\">These deformities or disruptions <b>21</b> can be produced in a variety of manners, for example, by providing a painted pattern, an etched pattern, a machined pattern, a printed pattern, a hot stamped pattern, or a molded pattern or the like on selected light output areas of the panel members. An ink or printed pattern may be applied for example by pad printing, silk screening, ink jet, heat transfer film process or the like. The deformities may also be printed on a sheet or film which is used to apply the deformities to the panel member. This sheet or film may become a permanent part of the light panel assembly for example by attaching or otherwise positioning the sheet or film against one or both sides of the panel member similar to the sheet or film <b>27</b> shown in <figref idrefs=\"DRAWINGS\">FIGS. 3 and 5</figref> in order to produce a desired effect.</p>\n  <p num=\"p-0038\">By varying the density, opaqueness or translucence, shape, depth, color, area, index of refraction, or type of deformities <b>21</b> on an area or areas of the panels, the light output of the panels can be controlled. The deformities or disruptions may be used to control the percent of light emitted from any area of the panels. For example, less and/or smaller size deformities <b>21</b> may be placed on panel areas where less light output is wanted. Conversely, a greater percentage of and/or larger deformities may be placed on areas of the panels where greater light output is desired.</p>\n  <p num=\"p-0039\">Varying the percentages and/or size of deformities in different areas of the panel is necessary in order to provide a uniform light output distribution. For example, the amount of light traveling through the panels will ordinarily be greater in areas closer to the light source than in other areas further removed from the light source. A pattern of light extracting deformities <b>21</b> may be used to adjust for the light variances within the panel members, for example, by providing a denser concentration of light extracting deformities with increased distance from the light source <b>3</b> thereby resulting in a more uniform light output distribution from the light emitting panels.</p>\n  <p num=\"p-0040\">The deformities <b>21</b> may also be used to control the output ray angle distribution of the emitted light to suit a particular application. For example, if the panel assemblies are used to provide a liquid crystal display backlight, the light output will be more efficient if the deformities <b>21</b> cause the light rays to emit from the panels at predetermined ray angles such that they will pass through the liquid crystal display with low loss.</p>\n  <p num=\"p-0041\">Additionally, the pattern of light extracting deformities may be used to adjust for light output variances attributed to light extractions of the panel members. The pattern of light extracting deformities <b>21</b> may be printed on the light output areas utilizing a wide spectrum of paints, inks, coatings, epoxies, or the like, ranging from glossy to opaque or both, and may employ half-tone separation techniques to vary the deformity <b>21</b> coverage. Moreover, the pattern of light extracting deformities <b>21</b> may be multiple layers or vary in index of refraction.</p>\n  <p num=\"p-0042\">Print patterns of light extracting deformities <b>21</b> may vary in shapes such as dots, squares, diamonds, ellipses, stars, random shapes, and the like, and are desirably 0.006 square inch per deformity/element or less. Also, print patterns that are 60 lines per inch or finer are desirably employed, thus making the deformities or shapes <b>21</b> in the print patterns nearly invisible to the human eye in a particular application thereby eliminating the detection of gradient or banding lines that are common to light extracting patterns utilizing larger elements. Additionally, the deformities may vary in shape and/or size along the length and/or width of the panel members. Also, a random placement pattern of the deformities may be utilized throughout the length and/or width of the panel members. The deformities may have shapes or a pattern with no specific angles to reduce moir&#xE9; or other interference effects. Examples of methods to create these random patterns are printing a pattern of shapes using stochastic print pattern techniques, frequency modulated half tone patterns, or random dot half tones. Moreover, the deformities may be colored in order to effect color correction in the panel members. The color of the deformities may also vary throughout the panel members, for example to provide different colors for the same or different light output areas.</p>\n  <p num=\"p-0043\">In addition to or in lieu of the patterns of light extracting deformities <b>21</b> shown in <figref idrefs=\"DRAWINGS\">FIG. 4</figref><i>a</i>, other light extracting deformities including prismatic surfaces, depressions or raised surfaces of various shapes using more complex shapes in a mold pattern may be molded, etched, stamped, thermoformed, hot stamped or the like into or on one or more areas of the panel member. <figref idrefs=\"DRAWINGS\">FIGS. 4</figref><i>b </i>and <b>4</b><i>c </i>show panel areas <b>22</b> on which prismatic surfaces <b>23</b> or depressions <b>24</b> are formed in the panel areas, whereas <figref idrefs=\"DRAWINGS\">FIG. 4</figref><i>d </i>shows prismatic or other reflective or refractive surfaces <b>25</b> formed on the exterior of the panel area. The prismatic surfaces, depressions or raised surfaces will cause a portion of the light rays contacted thereby to be emitted from the panel member. Also, the angles of the prisms, depressions or other surfaces may be varied to direct the light in different directions to produce a desired light output distribution or effect. Moreover, the reflective or refractive surfaces may have shapes or a pattern with no specific angles to reduce moir&#xE9; or other interference effects.</p>\n  <p num=\"p-0044\">As best seen in the cross sectional view of <figref idrefs=\"DRAWINGS\">FIG. 5</figref>, a back reflector (including trans reflectors) <b>26</b> may be attached or positioned against one side of the panel member <b>14</b> of <figref idrefs=\"DRAWINGS\">FIG. 3</figref> using a suitable adhesive <b>28</b> or other method in order to improve light output efficiency of the panel assembly <b>11</b> by reflecting the light emitted from that side back through the panel for emission through the opposite side. Additionally, a pattern of light extracting deformities <b>21</b>, <b>23</b>, <b>24</b> and/or <b>25</b> may be provided on one or both sides of the panel member in order to change the path of the light so that the internal critical angle is exceeded and a portion of the light is emitted from one or both sides of the panel. Moreover, a transparent film, sheet or plate <b>27</b> may be attached or positioned against the side or sides of the panel member from which light is emitted using a suitable adhesive <b>28</b> or other method in order to produce a desired effect.</p>\n  <p num=\"p-0045\">The member <b>27</b> may be used to further improve the uniformity of the light output distribution. For example, the member <b>27</b> may be a colored film, a diffuser, or a label or display, a portion of which may be a transparent overlay that may be colored and/or have text or an image thereon.</p>\n  <p num=\"p-0046\">If adhesive <b>28</b> is used to adhere the back reflector <b>26</b> and/or film <b>27</b> to the panel, the adhesive is preferably applied only along the side edges of the panel, and if desired the end edge opposite the light transition areas <b>12</b>, but not over the entire surface area or areas of the panel because of the difficulty in consistently applying a uniform coating of adhesive to the panel. Also, the adhesive changes the internal critical angle of the light in a less controllable manner than the air gaps <b>30</b> (see <figref idrefs=\"DRAWINGS\">FIG. 5</figref>) which are formed between the respective panel surfaces and the back reflector <b>26</b> and/or film <b>27</b> when only adhered along the peripheral edges. Additionally, longer panel members are achievable when air gaps <b>30</b> are used. If adhesive were to be used over the entire surface, the pattern of deformities could be adjusted to account for the additional attenuation in the light caused by the adhesive.</p>\n  <p num=\"p-0047\">Referring further to <figref idrefs=\"DRAWINGS\">FIG. 2</figref>, the panel assembly <b>5</b> shown therein also includes molded posts <b>31</b> at one or more corners of the panel <b>7</b> (four such posts being shown) which may be used to facilitate mounting of the panel assembly and providing structural support for other parts or components, for example, a display panel such as a liquid crystal display panel as desired.</p>\n  <p num=\"p-0048\"><figref idrefs=\"DRAWINGS\">FIG. 6</figref> shows another form of light emitting panel assembly <b>32</b> in accordance with this invention including a panel member <b>33</b>, one or more light sources <b>3</b>, and one or more light output areas <b>34</b>. In addition, the panel assembly <b>32</b> includes a tray <b>35</b> having a cavity or recess <b>36</b> in which the panel assembly <b>32</b> is received. The tray <b>35</b> may act as a back reflector as well as end edge and/or side edge reflectors for the panel <b>33</b> and side and/or back reflectors <b>37</b> for the light sources <b>3</b>. Additionally, one or more secondary reflective or refractive surfaces <b>38</b> may be provided on the panel member <b>33</b> and/or tray <b>35</b> to reflect a portion of the light around one or more corners or curves in a non-rectangular shaped panel member <b>33</b>. These secondary reflective/refractive surfaces <b>38</b> may be flat, angled, faceted or curved, and may be used to extract a portion of the light away from the panel member in a predetermined pattern. <figref idrefs=\"DRAWINGS\">FIG. 6</figref> also shows multiple light output areas <b>34</b> on the panel member that emit light from one or more light sources <b>3</b>.</p>\n  <p num=\"p-0049\"><figref idrefs=\"DRAWINGS\">FIG. 7</figref> is a schematic illustration of still another form of light emitting panel assembly <b>40</b> in accordance with this invention including a panel member <b>41</b> having one or more light output areas <b>42</b> and one or more light transition areas (mixing areas) <b>43</b> containing a plurality of light sources <b>3</b> at one or both ends of the panel. Each transition area mixes the light from one or more light sources having different colors and/or intensities. In this particular embodiment, each of the light sources <b>3</b> desirably employs three colored LEDs (red, blue, green) in each transition mixing area <b>43</b> so that the light from the three LEDs can be mixed to produce a desired light output color that will be emitted from the light output area <b>42</b>. Alternatively, each light source may be a single LED having multiple colored chips bonded to the lead film. Also, two colored LEDs or a single LED having two colored chips may be used for a particular application. By varying the intensities of the individual respective LEDs, virtually any colored light output or white light distribution can be achieved.</p>\n  <p num=\"p-0050\"><figref idrefs=\"DRAWINGS\">FIG. 8</figref> shows yet another form of light emitting panel assembly <b>45</b> in accordance with this invention including a light emitting panel member <b>46</b> and a light source <b>3</b> in a light transition area <b>48</b> integral with one end of the panel member. In this particular embodiment, the panel member <b>46</b> is three-dimensionally curved, for example, such that light rays may be emitted in a manner that facilitates aesthetic design of a lighted display.</p>\n  <p num=\"p-0051\"><figref idrefs=\"DRAWINGS\">FIG. 9</figref> schematically shows another form of light emitting panel assembly <b>50</b> in accordance with this invention, including a panel member <b>51</b> having multiple light output areas <b>52</b>, and mounting posts and/or mounting tabs <b>53</b>. This particular panel assembly <b>50</b> may serve as a structural member to support other parts or components as by providing holes or cavities <b>54</b>, <b>55</b> in the panel member <b>51</b> which allow for the insertion of modular components or other parts into the panel member. Moreover, a separate cavity or recess <b>56</b> may be provided in the panel member <b>51</b> for receipt of a correspondingly shaped light transition area <b>57</b> having one or more light sources <b>3</b> embedded, bonded, cast, insert molded, epoxied, or otherwise mounted or positioned therein and a curved reflective or refractive surface <b>58</b> on the transition area <b>57</b> and/or wall of the cavity or recess <b>56</b> to redirect a portion of the light in a predetermined manner. In this way the light transition area <b>57</b> and/or panel member may be in the form of a separate insert which facilitates the easy placement of the light source in a modular manner. A reflector <b>58</b> may be placed on the reflective or refractive surface of the cavity or recess <b>56</b> or insert <b>57</b>. Where the reflector <b>58</b> is placed on the reflective or refractive surface of the cavity or recess <b>56</b>, the cavity or recess may act as a mold permitting transparent material from which the transition area <b>57</b> is made to be cast around one or more light sources <b>3</b>.</p>\n  <p num=\"p-0052\"><figref idrefs=\"DRAWINGS\">FIGS. 10 and 11</figref> schematically show another form of light emitting panel assembly <b>60</b> in accordance with this invention including a panel member <b>61</b> having one or more light output areas <b>62</b>. In this particular embodiment, an off-axis light transition area <b>63</b> is provided that is thicker in cross section than the panel member to permit use of one or more light sources <b>3</b> embedded or otherwise mounted in the light transition area that are dimensionally thicker than the panel member. Also, a three-dimensional reflective surface <b>64</b> (<figref idrefs=\"DRAWINGS\">FIG. 11</figref>) may be provided on the transition area <b>63</b>. Moreover, a prism <b>65</b> (<figref idrefs=\"DRAWINGS\">FIG. 11</figref>) or tapered, rounded, or otherwise shaped end <b>66</b> (<figref idrefs=\"DRAWINGS\">FIG. 11</figref><i>a</i>) may be provided at the end of the panel opposite the light sources <b>3</b> to perform the function of an end reflector. The light sources <b>3</b> may be oriented at different angles relative to each other and offset to facilitate better mixing of the light rays <b>67</b> in the transition area <b>63</b> as schematically shown in <figref idrefs=\"DRAWINGS\">FIG. 10</figref> and/or to permit a shorter length transition area <b>63</b> to be used.</p>\n  <p num=\"p-0053\"><figref idrefs=\"DRAWINGS\">FIGS. 12 and 13</figref> schematically show still another form of light emitting panel assembly <b>70</b> in accordance with this invention which includes one or more light transition areas <b>71</b> at one or both ends of the panel member <b>72</b> each containing a single light source <b>73</b>. The transition area or areas <b>71</b> shown in <figref idrefs=\"DRAWINGS\">FIGS. 12 and 13</figref> collect light with multiple or three-dimensional surfaces and/or collect light in more than one plane. For example each transition area <b>71</b> shown in <figref idrefs=\"DRAWINGS\">FIGS. 12 and 13</figref> has elliptical and parabolic shape surfaces <b>74</b> and <b>75</b> in different planes for directing the light rays <b>76</b> into the panel member at a desired angle.</p>\n  <p num=\"p-0054\">Providing one or more transition areas at one or both ends of the panel member of any desired dimension to accommodate one or more light sources, with reflective and/or refractive surfaces on the transition areas for redirecting the light rays into the panel member at relatively low angles allows the light emitting panel member to be made much longer and thinner than would otherwise be possible. For example the panel members of the present invention may be made very thin, i.e., 0.125 inch thick or less.</p>\n  <p num=\"p-0055\"><figref idrefs=\"DRAWINGS\">FIG. 14</figref> schematically illustrates still another form of light emitting panel assembly <b>80</b> in accordance with this invention including a light emitting panel <b>81</b> and one or more light sources <b>3</b> positioned, embedded, potted, bonded or otherwise mounted in a light transition area <b>82</b> that is at an angle relative to the panel member <b>81</b> to permit more efficient use of space. An angled or curved reflective or refractive surface <b>83</b> is provided at the junction of the panel member <b>81</b> with the transition area <b>82</b> in order to reflect/refract light from the light source <b>3</b> into the body of the panel member <b>81</b> for emission of light from one or more light emitting areas <b>84</b> along the length of the panel member.</p>\n  <p num=\"p-0056\"><figref idrefs=\"DRAWINGS\">FIG. 15</figref> schematically illustrates still another form of light emitting panel assembly <b>90</b> in accordance with this invention including a light transition area <b>91</b> at one or both ends of a light emitting panel member <b>92</b> containing a slot <b>93</b> for sliding receipt of an LED or other suitable light source <b>3</b>. Preferably the slot <b>93</b> extends into the transition area <b>91</b> from the back edge <b>94</b>, whereby the light source <b>3</b> may be slid and/or snapped in place in the slot from the back, thus allowing the transition area to be made shorter and/or thinner. The light source <b>3</b> may be provided with wings, tabs or other surfaces <b>95</b> for engagement in correspondingly shaped recesses or grooves <b>96</b> or the like in the transition area <b>91</b> for locating and, if desired, securing the light source in place. Also, the light source <b>3</b> may be embedded, potted, bonded or otherwise secured within the slot <b>93</b> in the light transition area <b>91</b> of the panel member <b>92</b>. Light from a secondary light source <b>97</b> may be projected through the panel member <b>92</b> for indication or some other effect.</p>\n  <p num=\"p-0057\">The various light emitting panel assemblies disclosed herein may be used for a great many different applications including for example LCD back lighting or lighting in general, decorative and display lighting, automotive lighting, dental lighting, phototherapy or other medical lighting, membrane switch lighting, and sporting goods and apparel lighting or the like. Also the panel assemblies may be made such that the panel members and deformities are transparent without a back reflector. This allows the panel assemblies to be used for example to front light an LCD or other display such that the display is viewed through the transparent panel members.</p>\n  <p num=\"p-0058\">Although the invention has been shown and described with respect to certain preferred embodiments, it is obvious that equivalent alterations and modifications will occur to others skilled in the art upon the reading and understanding of the specification. The present invention includes all such equivalent alterations and modifications, and is limited only by the scope of the claims.</p>\n  <?DETDESC description=\"Detailed Description\" end=\"tail\"?>\n</description>"
  },
  "international_convention_data":{

  },
  "ifi_integrated_content":{
    "1":[

    ],
    "2":[
      1
    ],
    "3":[
      1
    ],
    "4":[
      1
    ],
    "5":[
      1
    ],
    "6":[
      1
    ],
    "7":[
      1
    ],
    "8":[
      1
    ],
    "9":[
      1
    ],
    "10":[

    ],
    "11":[

    ],
    "12":[
      11
    ],
    "13":[
      11
    ],
    "14":[
      11
    ],
    "15":[

    ],
    "16":[
      15
    ],
    "17":[
      15
    ],
    "18":[
      15
    ],
    "19":[
      15
    ]
  },
  "country":"US",
  "doc_number":"7963687",
  "kind":"B2",
  "patnum":"US7963687B2",
  "publication_id":"115663117"
}